Hzghero/motorcycle-led-remote-driver-v2/reference STM32c011f6p6-xl2400t/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "XL2400T.h"
#include "rf_xl2400.h"
#include <string.h>
#include <stdio.h>
#include <stdlib.h>
#include "stm32c0xx_hal_flash.h"
#include "stm32c0xx_hal_flash_ex.h"

/* 中文注释：
   - XL2400T.h 与 rf_xl2400.h 提供 2.4GHz RF 模块初始化、发送、接收接口
   - 采用 900ms 周期同步协议：0-450ms 发送同步包，450-900ms 接收同步包
   - LED 指示：PB6 (LED_Pin) 同步事件指示 + PA2 (PWM_GLOBAL) 全局 PWM 驱动
*/
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* ============================ 宏配置总区（集中管理） ============================
 * 说明：
 * 1) 先看“角色与构建模式”决定当前固件身份（TX/RX + 是否链路测试）；
 * 2) 再看“低功耗与调试”决定运行策略；
 * 3) 其余为协议与时序参数。 */

/* [A] 角色与构建模式（最关键）
 * - 正常发射端固件：APP_RF_LINK_TEST=0, APP_ROLE_TX_ONLY=1, APP_ROLE_RX_ONLY=0
 * - 正常接收端固件：APP_RF_LINK_TEST=0, APP_ROLE_TX_ONLY=0, APP_ROLE_RX_ONLY=1 */
#define APP_RF_LINK_TEST            1U  /* 1=开启链路诊断附加打印，0=关闭附加打印（不影响业务主流程） */
#define APP_ROLE_RX_ONLY            1U  /* 1=接收端固件 */
#define APP_ROLE_TX_ONLY            0U  /* 1=发射端固件 */

/* [A-2] RX 三线输入复用映射（仅 RX 角色生效）
 * 说明：同一工程内复用 TX 三键 IO 口给 RX 车辆输入，靠角色宏区分避免冲突。 */
#define RX_ACC_IN_PORT              L_KEY_GPIO_Port
#define RX_ACC_IN_PIN               L_KEY_Pin
#define RX_CAR_HI_IN_PORT           M_KEY_GPIO_Port
#define RX_CAR_HI_IN_PIN            M_KEY_Pin
#define RX_HORN_IN_PORT             R_KEY_GPIO_Port
#define RX_HORN_IN_PIN              R_KEY_Pin

/* RX 三线输入极性切换：
 * - NORMAL: 高电平有效（保持当前行为）
 * - INVERTED: 低电平有效（整体反向） */
#define RX_WIRE_ACTIVE_POLARITY_NORMAL    0U
#define RX_WIRE_ACTIVE_POLARITY_INVERTED  1U
#define RX_WIRE_ACTIVE_POLARITY           RX_WIRE_ACTIVE_POLARITY_INVERTED 

/* 三线防抖时间（单位ms）
 * 当前定标：50ms（用于提升车辆线束抖动/干扰场景下的稳定性）。
 * 若需更灵敏响应可回调到 20ms，但应重新做台架防抖与误触发验证。 */
#define RX_WIRE_DEBOUNCE_MS               50U

/* 黄线首次生效门限：首次需“双击”后才放开黄线控制（单位ms） */
#define RX_HI_FIRST_DBL_MS                600U

#if (RX_WIRE_ACTIVE_POLARITY == RX_WIRE_ACTIVE_POLARITY_INVERTED)
#define RX_IN_ACTIVE_LEVEL          GPIO_PIN_RESET
#define RX_WIRE_POLARITY_NAME       "INVERTED"
#else
#define RX_IN_ACTIVE_LEVEL          GPIO_PIN_SET
#define RX_WIRE_POLARITY_NAME       "NORMAL"
#endif

/* [B] 低功耗与诊断 */
#define TX_LOWPOWER_MODE_SLEEP      0U
#define TX_LOWPOWER_MODE_STOP       1U
#define TX_LOWPOWER_MODE_STANDBY    2U
#define TX_LOWPOWER_MODE            TX_LOWPOWER_MODE_STANDBY /* TX低功耗模式：SLEEP/STOP/STANDBY（当前测试STANDBY） */
#define LOWPOWER_DIAG_ENABLE        1U  /* 1=低功耗诊断打印，0=关闭诊断打印 */

/* [C] RF 基本参数
 * RF 频道强约束：TX=76 / RX=75 必须错开一档，严禁同频道。 */
#define RF_TX_CHANNEL               76U /* XL2400T TX 频道 76 (2476 MHz) */
#define RF_RX_CHANNEL               75U /* XL2400T RX 频道 75 (2475 MHz) */

/* [D] 旧同步/时序协议参数（历史保留）
 * 说明：以下 SYNC_* 为旧“太阳能同步闪灯”模块遗留参数。
 * 当前三键遥控 + RX三线仲裁主流程不依赖该模块，保留仅用于历史回溯与对比调试。
 * 如后续确认不再需要，再整体移除该模块（函数+宏）而不是只删单个宏。 */
#define SYNC_CYCLE_MS               900U    /* 旧同步周期 900ms */
#define SYNC_LED_ON_MS              100U    /* 旧同步LED亮灯时间 100ms */
#define SYNC_TX_TIME_MS             450U    /* 旧同步TX发送时间：所有节点固定 450ms */
#define SYNC_TX_DELAY_MS            6U      /* 旧同步传输延迟补偿 */
#define SYNC_PKT_SIZE               4U      /* 旧同步包：AA 55 + 2字节相位 */

/* 仅允许启用一个角色 */
#if (APP_ROLE_RX_ONLY + APP_ROLE_TX_ONLY) != 1
#error "APP_ROLE_RX_ONLY / APP_ROLE_TX_ONLY must enable exactly one role"
#endif

/* 临时灯光控制包（先测收发/解析，不上真正业务字段复杂度） */
/* 协议（8字节负载）：
 * byte0=0xAA, byte1=0x55  : 帧头
 * byte2=mode(1~7)        : 灯光模式号
 * byte3=bright(0~2)     : 亮度档位（0=30%, 1=70%, 2=100%）
 * byte4..byte7=0        : 预留（先不做 ID/校验）
 */
#define TLIGHT_PKT_HEADER0 0xAA
#define TLIGHT_PKT_HEADER1 0x55
#define TLIGHT_MODE_OFF     0U
#define TLIGHT_MODE_MIN     1U
#define TLIGHT_MODE_MAX     7U

#define TLIGHT_BRIGHT_30    0U
#define TLIGHT_BRIGHT_70    1U
#define TLIGHT_BRIGHT_100   2U

/* 临时协议扩展：加入按键来源/触发类型与序号，便于联调观察 */
#define TLIGHT_PKT_KEYTRIG_IDX    4U  /* bit7..6=key, bit5..4=trig, bit3..0=seq4 */
#define TLIGHT_PKT_DEV_ID_L_IDX   5U
#define TLIGHT_PKT_DEV_ID_H_IDX   6U
#define TLIGHT_PKT_CHKSUM_IDX     7U
#define TLIGHT_PKT_TAG_IDX        8U
#define TLIGHT_PKT_TAG_CONST      0x5AU

#define TLIGHT_KEY_NONE           3U
#define TLIGHT_KEY_L              0U
#define TLIGHT_KEY_M              1U
#define TLIGHT_KEY_R              2U

#define TLIGHT_TRIG_NONE          0U
#define TLIGHT_TRIG_SINGLE        1U
#define TLIGHT_TRIG_DOUBLE        2U
#define TLIGHT_TRIG_LONG          3U

/* 对码专用包标记（方案1）：仅在 TX 进入对码模式时发送；RX 对码窗口内仅接受该标记触发配对。 */
#define TLIGHT_PAIR_KEY_MARK      TLIGHT_KEY_NONE
#define TLIGHT_PAIR_TRIG_MARK     TLIGHT_TRIG_LONG

/* P1：设备ID（单向链路唯一性）
 * - TX 发送自己的设备ID
 * - RX 仅接收与本机已配对ID一致的数据包
 * 当前 8 字节包先使用 8-bit ID；后续若扩展 16-bit，可在 v1.1 增长包长度。 */
#define TLIGHT_DEVICE_ID_DEFAULT   0x2A2AU
#define TLIGHT_DEVICE_ID_INVALID   0x0000U

/* 对码流程（正式版） */
#define PAIRING_MODE_TIMEOUT_MS 5000U

/* 设备ID持久化（Flash 最后一页）
 * 说明：这是“对码流程骨架”实现。量产时建议在链接脚本明确预留参数页，避免与程序区冲突。 */
#define DEVCFG_MAGIC0              0xD1U
#define DEVCFG_MAGIC1              0xA5U
#define DEVCFG_VERSION             0x03U
#define DEVCFG_FLASH_ADDR          (FLASH_BASE + FLASH_SIZE - FLASH_PAGE_SIZE)
#define DEVCFG_FLASH_PAGE          (FLASH_PAGE_NB - 1U)

#define TLIGHT_MODE_SWITCH_INTERVAL_MS 2000U
#define LINK_RX_TIMEOUT_MS           1200U  /* 超过 1.2s 未收到有效包，判定链路超时 */
#define LINK_STATS_LOG_INTERVAL_MS   3000U  /* 每 3s 打印一次统计，避免刷屏 */
#define UART_CMD_BUF_SIZE            48U
#define UART_CMD_POLL_MAX_BYTES      8U   /* 每轮主循环最多处理字节数，防止串口命令饿死按键扫描 */
#define UART_CMD_ECHO_ENABLE         0U   /* 1=回显输入字符；0=不回显（降低阻塞） */

/* TX 低功耗策略已在“宏配置总区 [B]”集中定义 */

/* TX 发包策略：按键事件触发短突发；对码窗口内才周期发
 * 可靠性调优（STANDBY 场景）：
 * - 事件突发帧数增加到 8，提升“至少命中一帧”概率
 * - 保持 40ms 帧间隔，降低对原时序与空口占用的冲击
 * - 新增事件后活跃保持窗口，避免“刚发完就回睡”导致 RX 偶发漏收 */
#define LINK_TX_EVENT_BURST_COUNT    8U
#define LINK_TX_BURST_INTERVAL_MS    40U
#define LINK_TX_PAIRING_INTERVAL_MS  120U
#define RF_TX_WAKEUP_SETTLE_MS       2U
#define RF_TX_BOOT_WARM_MS           1500U
#define LINK_TX_BOOT_BURST_COUNT     6U
#define TX_POST_EVENT_HOLD_MS        400U

/* TX 低功耗抗漏按参数（方向A）：
 * - 唤醒保护窗口：唤醒后至少保持一段时间不回睡，给按键去抖/识别留时间
 * - 按键活动保持：检测到任一按键按下后，再保持一段时间活跃，避免短按被切碎 */
#define TX_LP_WAKE_GUARD_MS          3000U /* 折中增强：唤醒后至少保持3s活跃，降低快速回睡与频繁Flash写入 */
#define TX_LP_KEY_ACTIVE_HOLD_MS     1100U /* 微调：按键活动保持1.1s，覆盖双击/长按又减少常亮耗电 */
#define TX_STUCK_KEY_FORCE_SLEEP_MS 10000U /* 卡键保护：任一键持续按下10s后强制进低功耗 */

