Hzghero/motorcycle-led-remote-driver-v2/reference STM32c011f6p6-xl2400t/Core/Src/main.c
/* ===================== TX 状态持久化宏配置表（量产可调） =====================
 * 使用说明（仅改这里即可完成车型调参）：
 * 1) TX_PERSIST_ENABLE
 *    - 1：启用状态持久化（推荐量产）
 *    - 0：关闭持久化（仅临时调试）
 *
 * 2) TX_STATE_SAVE_DEFER_MS（延迟合并）
 *    - 状态变化后，至少静默这么久再尝试保存
 *    - 值越大，写入越少；但掉电时丢“最新瞬态”的概率略升
 *
 * 3) TX_STATE_SAVE_MIN_INTERVAL_MS（最小写间隔）
 *    - 仅限制“后台延迟提交”的频率
 *    - 不限制“进 STANDBY 前兜底提交”（兜底优先，防止丢最终状态）
 *
 * 4) TX_STATE_SAVE_FORCE_BEFORE_STANDBY
 *    - 1：进入 STANDBY 前若 dirty 则强制保存一次（推荐）
 *    - 0：不兜底，寿命更优但有丢最终状态风险
 *
 * 5) TX_STATE_SAVE_COUNTER_LOG_ENABLE
 *    - 1：上电打印累计写入计数，便于寿命评估
 *    - 0：关闭该日志 */
#define TX_PERSIST_ENABLE                    1U
#define TX_STATE_SAVE_DEFER_MS            2000U
#define TX_STATE_SAVE_MIN_INTERVAL_MS    30000U
#define TX_STATE_SAVE_FORCE_BEFORE_STANDBY  1U
#define TX_STATE_SAVE_COUNTER_LOG_ENABLE     1U

/* 简化可见指示（用 LED_Pin，不做真实 LM3409 PWM 还原） */
#define LED_FLASH_PERIOD_MS  250U   /* 闪烁周期 */
#define LED_BREATH_PERIOD_MS 800U   /* 呼吸周期（简化为慢速占空） */

/* RX 模式 4~7 灯效可调参数（统一放宏，便于快速调效果）
 * 说明：
 * - 频率(Hz) ≈ 1000 / (2 * 半周期ms)
 * - 呼吸总周期(ms) = 从暗到亮再到暗的完整时间
 */
#define FX4_FLASH_HALF_PERIOD_MS     100U   /* 模式4：双远光同步闪 半周期，默认 2Hz */
#define FX5_ALT_HALF_PERIOD_MS       260U   /* 模式5：左右交替闪 半周期，留意这里通过修改定时器时间基解决了。 */
#define FX6_BREATH_PERIOD_MS        4000U   /* 模式6：呼吸灯总周期，默认 2s */
#define FX7_WHEEL_HALF_PERIOD_MS     100U   /* 模式7：左右轮闪 半周期，默认 2Hz 轮闪 */

/* 蓝线(HORN)独立爆闪参数（不复用右键模式链） */
#define HORN_FLASH_HALF_PERIOD_MS     50U   /* 50ms亮 / 50ms灭 */

#define DEBUG_ADC_VERBOSE  0   /* 调试：1=打印 ADC 采样值，完成后可改为 0 精简 */
#define DEBUG_SYNC_VERBOSE 1   /* 调试：1=打印详细同步信息，0=只打印关键事件 */
#define DEBUG_LED_VERBOSE  1   /* 调试：1=打印LED状态，0=不打印 */
#define DEBUG_PERIODIC     0   /* 调试：1=启用定期打印（影响功耗），0=禁用 */
#define UART_LOG_ENABLE    1   /* 串口日志总开关：1=开启打印，0=关闭打印（先用于排查波形） */
#define RX_LOCAL_EFFECT_TEST  0U  /* RX本地灯效测试：1=忽略RF命令并按本地脚本切模式 */
#define RX_LOCAL_STEP_MS      8000U /* 本地测试每个模式驻留时间 */
#define RX_LOCAL_TEST_BRIGHT  TLIGHT_BRIGHT_70 /* 本地测试亮度：70% 便于观察PWM相位锁定 */

/* PWM_GLOBAL 强制电平测试开关：
 * 0 = 按正常模式输出 PWM 占空比
 * 1 = 强制低电平（0%）
 * 2 = 强制高电平（100%） */
#define PWM_GLOBAL_FORCE_LEVEL  0U

/* 按键对码（L=PB6, R=PA2，内部下拉，按下为高） */
#define KEY_ACTIVE_LEVEL        GPIO_PIN_SET
#define KEY_DEBOUNCE_MS         20U
#define KEY_LONG_MS             2000U
#define KEY_COMBO_SIMULT_MS     150U   /* L/R 组合键“同时按下”窗口：超窗按单键处理 */

/* RX 对码结果反馈（通过近光灯） */
#define RX_PAIR_SUCCESS_HOLD_MS       1000U
#define RX_PAIR_FAIL_FLASH_HALF_MS    120U
#define RX_PAIR_FAIL_FLASH_TOGGLE_CNT 6U

/* TX 三键熄灯/点亮规则（v0.3.3） */
#define KEY_TX_LONG_MS          1000U
#define KEY_TX_DBL_MS           200U
#define KEY_TX_TAP_MAX_MS       320U
#define KEY_TX_DOUBLE_ENABLE    1U
#define TX_KEY_LED_ON_MS        180U

/* TX 右键本地调试（积木化排查）
 * 1: 仅测试右键 single/double/long 的识别与 LED 反馈，不走业务发送
 * 0: 关闭调试，恢复正常业务逻辑 */
#define TX_KEY_R_DEBUG_ONLY     0U
#define RDBG_LED_STEP_MS        500U
#define RDBG_LED_DBL_HOLD_MS    2000U

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim14;

UART_HandleTypeDef huart1;

/* USER CODE BEGIN PV */
static uint8_t RF_TX_Buf[RF_PACKET_SIZE]   = {0};
static uint8_t RF_RX_Buf[RF_PACKET_SIZE]   = {0};

static uint32_t g_cycle = 0;
static uint16_t g_phase_ms = 0;
static uint32_t g_last_tick_ms = 0;
static uint32_t g_last_tx_cycle = (uint32_t)-1;

static uint8_t  g_rf_mode = 0;
static uint8_t  g_led_state = 0;
static uint32_t g_led_on_tick = 0;

static uint8_t  g_rf_sleeping = 0;
static uint32_t g_adc_display_tick = 0;  /* ADC显示计时器 */
static uint32_t g_lp_enter_cnt = 0U;     /* 低功耗进入计数（诊断） */
static uint32_t g_lp_wake_cnt = 0U;      /* 低功耗唤醒计数（诊断） */
static uint32_t g_tx_lp_wake_tick = 0U;  /* TX 低功耗唤醒时刻+1（0=未生效），用于唤醒保护窗口 */
static uint32_t g_tx_key_active_until_tick = 0U; /* TX 按键活动保持截止时刻 */
static uint8_t  g_boot_lp_wufi = 0U;      /* 本次启动早期捕获的 WUFI 标志 */
static uint8_t  g_boot_lp_wuf1 = 0U;      /* 本次启动早期捕获的 WUF1 标志 */
static uint8_t  g_boot_lp_wuf2 = 0U;      /* 本次启动早期捕获的 WUF2 标志 */
static uint8_t  g_boot_lp_wuf3 = 0U;      /* 本次启动早期捕获的 WUF3 标志 */
static uint8_t  g_boot_lp_wuf4 = 0U;      /* 本次启动早期捕获的 WUF4 标志 */
static uint8_t  g_boot_lp_sbf = 0U;       /* 本次启动早期捕获的 SBF 标志 */
static uint8_t  g_tx_boot_wkup_pending_key = TLIGHT_KEY_NONE; /* STANDBY 唤醒补发单击：L/M/R */
static uint32_t g_tx_post_event_hold_until_tick = 0U;  /* 事件后活跃保持截止时刻，防止发完即回睡 */
static uint8_t  g_tx_state_dirty = 0U;                 /* TX 业务状态脏标记：1=待提交到Flash */
static uint32_t g_tx_state_dirty_since_tick = 0U;      /* 首次变脏时刻，用于延迟合并提交 */
static uint32_t g_tx_state_last_save_tick = 0U;        /* 最近一次成功提交时刻，用于最小间隔节流 */
static uint16_t g_tx_state_save_count = 0U;            /* TX 状态累计写入次数（上电日志可见） */

/* 链路调试统计（用于串口观测通信质量） */
static uint8_t  g_link_tx_seq = 0;
static uint8_t  g_link_last_rx_seq = 0;
static uint8_t  g_tx_last_key = TLIGHT_KEY_NONE;
static uint8_t  g_tx_last_trig = TLIGHT_TRIG_NONE;
static uint8_t  g_link_has_last_seq = 0;
static uint32_t g_link_tx_ok = 0;
static uint32_t g_link_tx_fail = 0;
static uint32_t g_link_rx_ok = 0;
static uint32_t g_link_rx_parse_err = 0;
static uint32_t g_link_rx_dev_mismatch = 0;
static uint32_t g_link_rx_dup = 0;
static uint32_t g_link_rx_jump = 0;
static uint8_t  g_link_timeout_flag = 0;
static uint32_t g_link_last_rx_tick = 0;
static uint32_t g_link_last_stats_tick = 0;
static uint32_t g_link_last_log_tx_ok = 0;
static uint32_t g_link_last_log_tx_fail = 0;
static uint8_t  g_link_last_log_tx_awake = 0xFFU;

/* 设备ID运行态（来自 Flash，16-bit） */
static uint16_t g_dev_id_local = TLIGHT_DEVICE_ID_DEFAULT;
static uint16_t g_dev_id_paired = TLIGHT_DEVICE_ID_DEFAULT;

/* 串口命令缓存（P1 临时对码入口） */
static char g_uart_cmd_buf[UART_CMD_BUF_SIZE] = {0};
static uint8_t g_uart_cmd_len = 0;

/* 按键状态（L/R 组合键进入对码） */
static uint8_t  g_pair_last_raw = 0U;
static uint8_t  g_pair_stable = 0U;
static uint8_t  g_pair_long_done = 0U;
static uint32_t g_pair_raw_change_tick = 0;
static uint32_t g_pair_press_start_tick = 0;
static uint32_t g_pair_l_down_tick = 0U;
static uint32_t g_pair_r_down_tick = 0U;
static uint8_t  g_pair_combo_armed = 0U;
static uint8_t  g_pair_guard_log_state = 0U;

static uint32_t g_tx_anykey_down_tick = 0U;
static uint8_t  g_tx_force_sleep_latched = 0U;

/* 正式对码流程状态 */
static uint8_t  g_pairing_mode = 0U;
static uint32_t g_pairing_enter_tick = 0U;
static uint32_t g_pair_led_tick = 0U;

