Hzghero/motorcycle-led-remote-driver-v2/reference STM32c011f6p6-xl2400t/Core/Src/main.c
typedef enum {
  PAIR_FB_NONE = 0,
  PAIR_FB_SUCCESS,
  PAIR_FB_FAIL
} PairFeedbackState_t;

typedef enum {
  RX_PAIR_FB_NONE = 0,
  RX_PAIR_FB_SUCCESS_HOLD,
  RX_PAIR_FB_FAIL_FLASH
} RxPairFeedbackState_t;

static PairFeedbackState_t g_pair_fb_state = PAIR_FB_NONE;
static uint32_t g_pair_fb_tick = 0U;
static uint8_t g_pair_fb_step = 0U;

static RxPairFeedbackState_t g_rx_pair_fb_state = RX_PAIR_FB_NONE;
static uint32_t g_rx_pair_fb_tick = 0U;
static uint8_t g_rx_pair_fb_step = 0U;

/* TX 三键事件（由按键状态机在主循环生成） */
static volatile uint8_t g_tx_evt_l = 0U;
static volatile uint8_t g_tx_evt_m = 0U;
static volatile uint8_t g_tx_evt_r = 0U;

/* TX 按键识别状态（单击/双击/长按） */
typedef struct {
  uint8_t  stable_level;
  uint8_t  last_raw;
  uint32_t raw_change_tick;
  uint32_t press_start_tick;
  uint32_t last_press_duration_ms;
  uint8_t  long_reported;
  uint8_t  click_pending;
  uint32_t first_click_tick;
  uint8_t  suppress_release_after_double;
} TxKeyState_t;

static TxKeyState_t g_txk_l = {0};
static TxKeyState_t g_txk_m = {0};
static TxKeyState_t g_txk_r = {0};

/* TX 业务态（按功能说明书语义）
 * 上电默认 OFF：确保首次右键单击走“OFF->特效1(模式4)”入口。 */
static uint8_t g_tx_mode = TLIGHT_MODE_OFF;
static uint8_t g_tx_bright = TLIGHT_BRIGHT_30;
static uint8_t g_tx_basic_mode = TLIGHT_MODE_MIN;  /* 1..3 */
static uint8_t g_tx_effect_mode = 4U;              /* 4..7 */
static uint8_t g_tx_in_effect = 0U;
static uint8_t g_tx_is_off = 1U;
static uint8_t g_tx_left_all_on_armed = 0U;
static uint8_t g_tx_need_send = 0U;
static uint8_t g_tx_burst_left = 0U;
static uint32_t g_tx_last_send_tick = 0U;
static uint8_t g_tx_rf_awake = 1U;
static uint32_t g_tx_rf_wakeup_tick = 0U;
static uint8_t g_tx_boot_warm_done = 0U;
static uint32_t g_tx_boot_warm_until = 0U;
static uint8_t g_tx_first_event_done = 0U;

#if APP_ROLE_TX_ONLY
static uint8_t g_rdbg_evt_single = 0U;
static uint8_t g_rdbg_evt_double = 0U;
static uint8_t g_rdbg_evt_long = 0U;
static uint32_t g_rdbg_single_cnt = 0U;
static uint32_t g_rdbg_double_cnt = 0U;
static uint32_t g_rdbg_long_cnt = 0U;

typedef enum {
  RDBG_LED_IDLE = 0,
  RDBG_LED_SINGLE_ON,
  RDBG_LED_LONG_ON,
  RDBG_LED_LONG_OFF,
  RDBG_LED_DBL_HOLD
} RdbgLedState_t;

static RdbgLedState_t g_rdbg_led_state = RDBG_LED_IDLE;
static uint32_t g_rdbg_led_mark = 0U;
static uint8_t g_rdbg_led_long_remain = 0U;
#endif

/* 双路 PWM 灯效状态（RX-only） */
static uint8_t g_light_mode = TLIGHT_MODE_OFF;
static uint8_t g_light_bright = TLIGHT_BRIGHT_30;

/* RX 三线输入状态（ACC/原车远光/喇叭） */
static uint8_t g_rx_acc_last = 0U;
static uint8_t g_rx_hi_last = 0U;
static uint8_t g_rx_horn_last = 0U;
static uint8_t g_rx_acc_raw_last = 0U;
static uint8_t g_rx_hi_raw_last = 0U;
static uint8_t g_rx_horn_raw_last = 0U;
static uint32_t g_rx_acc_raw_change_tick = 0U;
static uint32_t g_rx_hi_raw_change_tick = 0U;
static uint32_t g_rx_horn_raw_change_tick = 0U;
static uint8_t g_rx_horn_active = 0U;
static uint8_t g_rx_pre_horn_mode = TLIGHT_MODE_OFF;
static uint8_t g_rx_pre_horn_bright = TLIGHT_BRIGHT_30;
static uint8_t g_rx_remote_pending_valid = 0U;
static uint8_t g_rx_remote_pending_mode = TLIGHT_MODE_OFF;
static uint8_t g_rx_remote_pending_bright = TLIGHT_BRIGHT_30;

/* 黄线首次“双触发”解锁：未解锁前忽略黄线边沿；在窗口内发生两次边沿后解锁 */
static uint8_t g_rx_hi_gate_unlocked = 0U;
static uint8_t g_rx_hi_edge_cnt = 0U;
static uint32_t g_rx_hi_first_edge_tick = 0U;

/* 相位锁定节拍（1ms） */
static volatile uint16_t g_phase_1ms = 0U;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_TIM14_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_TIM1_Init(void);
/* USER CODE BEGIN PFP */
static void DebugPrint(const char *s);
static void DebugPrintHex(const uint8_t *buf, uint8_t len);
static void DebugPrintDec(uint16_t val);
static void SyncTime_Update(void);
static void SyncLamp_Update(void);
static void BuildSyncPacket(uint8_t *pkt);
static uint16_t ParseSyncPacket(const uint8_t *pkt);
static void BuildTempLightPacket(uint8_t *pkt, uint8_t mode, uint8_t bright, uint8_t key, uint8_t trig);
static uint8_t ParseTempLightPacket(const uint8_t *pkt, uint8_t *mode, uint8_t *bright, uint8_t *key, uint8_t *trig);
static uint8_t TempLight_CalcChecksum(const uint8_t *pkt);
static uint8_t DevId_CalcCrc8(const uint8_t *buf, uint8_t len);
static uint16_t DevId_FromUid(void);
static void DevId_LoadFromFlash(void);
static uint8_t DevId_SaveToFlash(uint16_t local_id, uint16_t paired_id);
static uint8_t TxState_SaveToFlash(void);
static void TxState_MarkDirty(uint32_t now);
static void TxState_SaveWorker(uint32_t now);
static void UartCmd_Poll(void);
static void UartCmd_HandleLine(const char *line);
static void KeyPairing_Poll(uint32_t now);
static void LinkStats_Log(uint32_t now);
static void Sync_AdjustFromPacket(uint16_t rx_phase_ms);
static void Sync_MainLoop(void);
static void Light_Tick(uint32_t now);
static void PwmGlobal_Set(uint16_t pulse);
static void Channel_ApplyMask(uint8_t mask);
static void PairingLed_Update(uint32_t now);
static void PairingLed_Feedback(uint8_t success);
static void RxWireInput_Poll(uint32_t now);
static uint8_t TxKey_ReadRaw(uint16_t pin, GPIO_TypeDef *port);
static void TxKeys_Process(uint32_t now, uint8_t tick_1ms);
static void TxKeyR_DebugLedTask(uint32_t now);
static uint16_t GetPhase1ms(uint16_t period_ms);
static void EnterTxLowPower(void);
static void ExitTxLowPower(void);
static void LowPowerDiag_LogRfPins(void);
static void LowPowerDiag_LogWakeFlags(void);
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

typedef struct {
  uint8_t magic0;
  uint8_t magic1;
  uint8_t version;
  uint8_t local_id_l;
  uint8_t local_id_h;
  uint8_t paired_id_l;
  uint8_t paired_id_h;
  uint8_t tx_mode;
  uint8_t tx_bright;
  uint8_t tx_flags;   /* bit0: is_off, bit1: in_effect */
  uint8_t tx_basic_mode;
  uint8_t tx_effect_mode;
  uint8_t tx_save_cnt_l; /* 状态持久化累计写入计数（低字节） */
  uint8_t tx_save_cnt_h; /* 状态持久化累计写入计数（高字节） */
  uint8_t crc8;
  uint8_t tail;
} DevCfg_t;

static uint8_t DevId_CalcCrc8(const uint8_t *buf, uint8_t len)
{
  uint8_t x = 0;
  uint8_t i = 0;
  for (i = 0; i < len; i++) {
    x ^= buf[i];
  }
  return x;
}

static uint16_t DevId_FromUid(void)
{
  const uint32_t *uid = (const uint32_t *)UID_BASE;
  uint32_t mix = uid[0] ^ uid[1] ^ uid[2];
  mix ^= (mix >> 16);
  uint16_t id = (uint16_t)(mix & 0xFFFFU);
  if (id == TLIGHT_DEVICE_ID_INVALID) {
    id = TLIGHT_DEVICE_ID_DEFAULT;
  }
  return id;
}

static void DevId_LoadFromFlash(void)
{
  const DevCfg_t *cfg = (const DevCfg_t *)DEVCFG_FLASH_ADDR;
  uint8_t calc = DevId_CalcCrc8((const uint8_t *)cfg, 14U);
  uint16_t local_id = (uint16_t)((cfg->local_id_h << 8) | cfg->local_id_l);
  uint16_t paired_id = (uint16_t)((cfg->paired_id_h << 8) | cfg->paired_id_l);

