Hzghero/motorcycle-led-remote-driver-v2/reference STM32c011f6p6-xl2400t/Core/Src/main.c
  if ((cfg->magic0 == DEVCFG_MAGIC0) &&
      (cfg->magic1 == DEVCFG_MAGIC1) &&
      (cfg->version == DEVCFG_VERSION) &&
      (cfg->tail == TLIGHT_PKT_TAG_CONST) &&
      (local_id != TLIGHT_DEVICE_ID_INVALID) &&
      (paired_id != TLIGHT_DEVICE_ID_INVALID) &&
      (cfg->tx_mode <= TLIGHT_MODE_MAX) &&
      (cfg->tx_bright <= TLIGHT_BRIGHT_100) &&
      (cfg->tx_basic_mode >= TLIGHT_MODE_MIN) &&
      (cfg->tx_basic_mode <= 3U) &&
      (cfg->tx_effect_mode >= 4U) &&
      (cfg->tx_effect_mode <= TLIGHT_MODE_MAX) &&
      (cfg->crc8 == calc)) {
    g_dev_id_local = local_id;
    g_dev_id_paired = paired_id;
    g_tx_mode = cfg->tx_mode;
    g_tx_bright = cfg->tx_bright;
    g_tx_is_off = (uint8_t)(cfg->tx_flags & 0x01U);
    g_tx_in_effect = (uint8_t)((cfg->tx_flags >> 1) & 0x01U);
    g_tx_basic_mode = cfg->tx_basic_mode;
    g_tx_effect_mode = cfg->tx_effect_mode;
    g_tx_state_save_count = (uint16_t)((cfg->tx_save_cnt_h << 8) | cfg->tx_save_cnt_l);
    g_tx_left_all_on_armed = 0U;
    return;
  }

  /* Flash 未初始化或损坏：使用 UID 派生默认ID并回写一次 */
  g_dev_id_local = DevId_FromUid();
  g_dev_id_paired = g_dev_id_local;
  g_tx_mode = TLIGHT_MODE_OFF;
  g_tx_bright = TLIGHT_BRIGHT_30;
  g_tx_basic_mode = TLIGHT_MODE_MIN;
  g_tx_effect_mode = 4U;
  g_tx_in_effect = 0U;
  g_tx_is_off = 1U;
  g_tx_left_all_on_armed = 0U;
  g_tx_state_save_count = 0U;
  (void)DevId_SaveToFlash(g_dev_id_local, g_dev_id_paired);
}

static uint8_t DevId_SaveToFlash(uint16_t local_id, uint16_t paired_id)
{
  FLASH_EraseInitTypeDef erase = {0};
  uint32_t page_error = 0;
  DevCfg_t cfg;
  uint64_t row0 = 0;
  uint64_t row1 = 0;

  if ((local_id == TLIGHT_DEVICE_ID_INVALID) || (paired_id == TLIGHT_DEVICE_ID_INVALID)) {
    return 0;
  }

  memset(&cfg, 0, sizeof(cfg));
  cfg.magic0 = DEVCFG_MAGIC0;
  cfg.magic1 = DEVCFG_MAGIC1;
  cfg.version = DEVCFG_VERSION;
  cfg.local_id_l = (uint8_t)(local_id & 0xFFU);
  cfg.local_id_h = (uint8_t)(local_id >> 8);
  cfg.paired_id_l = (uint8_t)(paired_id & 0xFFU);
  cfg.paired_id_h = (uint8_t)(paired_id >> 8);
  cfg.tx_mode = g_tx_mode;
  cfg.tx_bright = g_tx_bright;
  cfg.tx_flags = (uint8_t)((g_tx_is_off & 0x01U) | ((g_tx_in_effect & 0x01U) << 1));
  cfg.tx_basic_mode = g_tx_basic_mode;
  cfg.tx_effect_mode = g_tx_effect_mode;
  cfg.tx_save_cnt_l = (uint8_t)(g_tx_state_save_count & 0xFFU);
  cfg.tx_save_cnt_h = (uint8_t)(g_tx_state_save_count >> 8);
  cfg.crc8 = DevId_CalcCrc8((const uint8_t *)&cfg, 14U);
  cfg.tail = TLIGHT_PKT_TAG_CONST;

  memcpy(&row0, &cfg, sizeof(row0));
  memcpy(&row1, ((const uint8_t *)&cfg) + sizeof(row0), sizeof(row1));

  HAL_FLASH_Unlock();

  erase.TypeErase = FLASH_TYPEERASE_PAGES;
  erase.Page = DEVCFG_FLASH_PAGE;
  erase.NbPages = 1;
  if (HAL_FLASHEx_Erase(&erase, &page_error) != HAL_OK) {
    HAL_FLASH_Lock();
    return 0;
  }

  if (HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, DEVCFG_FLASH_ADDR, row0) != HAL_OK) {
    HAL_FLASH_Lock();
    return 0;
  }

  if (HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, DEVCFG_FLASH_ADDR + 8U, row1) != HAL_OK) {
    HAL_FLASH_Lock();
    return 0;
  }

  HAL_FLASH_Lock();

  g_dev_id_local = local_id;
  g_dev_id_paired = paired_id;
  return 1;
}

/* TX 状态持久化：把当前灯态写入 Flash，供 STANDBY 唤醒后恢复上次业务状态。 */
static uint8_t TxState_SaveToFlash(void)
{
#if APP_ROLE_TX_ONLY
  if (TX_PERSIST_ENABLE == 0U) {
    return 1U;
  }

  if (g_tx_state_save_count != 0xFFFFU) {
    g_tx_state_save_count++;
  }

  if (DevId_SaveToFlash(g_dev_id_local, g_dev_id_paired) == 0U) {
    if (g_tx_state_save_count != 0U) {
      g_tx_state_save_count--;
    }
    DebugPrint("[TX-STATE] flash save fail\r\n");
    return 0U;
  }
  g_tx_state_last_save_tick = HAL_GetTick();
  return 1U;
#else
  return 0U;
#endif
}

/* 标记状态变更：由按键业务触发，交给后台节流保存，避免每次按键都写Flash。 */
static void TxState_MarkDirty(uint32_t now)
{
#if APP_ROLE_TX_ONLY
  if (g_tx_state_dirty == 0U) {
    g_tx_state_dirty = 1U;
    g_tx_state_dirty_since_tick = now;
  }
#else
  (void)now;
#endif
}

/* TX 状态保存后台任务：
 * - 先做延迟合并提交（减少写入次数）
 * - 满足最小间隔后再落盘
 * - 在进入 STANDBY 前由主流程强制兜底提交（不在这里做） */
static void TxState_SaveWorker(uint32_t now)
{
#if APP_ROLE_TX_ONLY
  if (g_tx_state_dirty == 0U) {
    return;
  }

  if ((now - g_tx_state_dirty_since_tick) < TX_STATE_SAVE_DEFER_MS) {
    return;
  }

  if ((g_tx_state_last_save_tick != 0U) && ((now - g_tx_state_last_save_tick) < TX_STATE_SAVE_MIN_INTERVAL_MS)) {
    return;
  }

  if (TxState_SaveToFlash() != 0U) {
    g_tx_state_dirty = 0U;
    DebugPrint("[TX-STATE] save commit(defer)\r\n");
  }
#else
  (void)now;
#endif
}

static void UartCmd_HandleLine(const char *line)
{
  unsigned long v = 0;

  if ((line[0] == '\0') || (line[0] == '\r') || (line[0] == '\n')) {
    return;
  }

  if ((strcmp(line, "HELP") == 0) || (strcmp(line, "help") == 0)) {
    DebugPrint("[CMD] HELP/ID?/PAIR?/ID <1..65535>/PAIR <1..65535>\r\n");
    return;
  }

  if ((strcmp(line, "ID?") == 0) || (strcmp(line, "id?") == 0)) {
    DebugPrint("[CMD] ID=");
    DebugPrintHex((const uint8_t *)&g_dev_id_local, 2);
    DebugPrint("\r\n");
    return;
  }

  if ((strcmp(line, "PAIR?") == 0) || (strcmp(line, "pair?") == 0)) {
    DebugPrint("[CMD] PAIRED=");
    DebugPrintHex((const uint8_t *)&g_dev_id_paired, 2);
    DebugPrint("\r\n");
    return;
  }

  if ((strncmp(line, "ID ", 3) == 0) || (strncmp(line, "id ", 3) == 0)) {
    v = strtoul(&line[3], NULL, 10);
    if ((v >= 1UL) && (v <= 65535UL)) {
      if (DevId_SaveToFlash((uint16_t)v, g_dev_id_paired)) {
        DebugPrint("[CMD] ID saved: ");
        DebugPrintHex((const uint8_t *)&g_dev_id_local, 2);
        DebugPrint("\r\n");
      } else {
        DebugPrint("[CMD-ERR] ID save fail\r\n");
      }
    } else {
      DebugPrint("[CMD-ERR] ID range 1..65535\r\n");
    }
    return;
  }

  if ((strncmp(line, "PAIR ", 5) == 0) || (strncmp(line, "pair ", 5) == 0)) {
    v = strtoul(&line[5], NULL, 10);
    if ((v >= 1UL) && (v <= 65535UL)) {
      if (DevId_SaveToFlash(g_dev_id_local, (uint16_t)v)) {
        DebugPrint("[CMD] PAIRED saved: ");
        DebugPrintHex((const uint8_t *)&g_dev_id_paired, 2);
        DebugPrint("\r\n");
      } else {
        DebugPrint("[CMD-ERR] PAIRED save fail\r\n");
      }
    } else {
      DebugPrint("[CMD-ERR] PAIR range 1..65535\r\n");
    }
    return;
  }

