Hzghero/motorcycle-led-remote-driver-v2/reference STM32c011f6p6-xl2400t/Core/Src/main.c
  DebugPrint("[CMD-ERR] Unknown. use HELP\r\n");
}

static void UartCmd_Poll(void)
{
  uint8_t ch = 0;
  uint8_t processed = 0U;

  while ((processed < UART_CMD_POLL_MAX_BYTES) && (HAL_UART_Receive(&huart1, &ch, 1, 0) == HAL_OK)) {
#if UART_CMD_ECHO_ENABLE
    /* 回显，便于确认命令确实被固件接收到了 */
    HAL_UART_Transmit(&huart1, &ch, 1, 20);
#endif

    if ((ch == '\r') || (ch == '\n')) {
      DebugPrint("\r\n");
      g_uart_cmd_buf[g_uart_cmd_len] = '\0';
      UartCmd_HandleLine(g_uart_cmd_buf);
      g_uart_cmd_len = 0;
      processed++;
      continue;
    }

    if ((ch >= 32U) && (ch <= 126U)) {
      if (g_uart_cmd_len < (UART_CMD_BUF_SIZE - 1U)) {
        g_uart_cmd_buf[g_uart_cmd_len++] = (char)ch;
      } else {
        g_uart_cmd_len = 0;
        DebugPrint("[CMD-ERR] too long\r\n");
      }
    }

    processed++;
  }
}

static void KeyPairing_Poll(uint32_t now)
{
  uint8_t l_raw = (HAL_GPIO_ReadPin(L_KEY_GPIO_Port, L_KEY_Pin) == KEY_ACTIVE_LEVEL) ? 1U : 0U;
  uint8_t r_raw = (HAL_GPIO_ReadPin(R_KEY_GPIO_Port, R_KEY_Pin) == KEY_ACTIVE_LEVEL) ? 1U : 0U;
  uint8_t raw = (l_raw && r_raw) ? 1U : 0U;

  /* 退出对码超时（TX/RX 通用） */
  if ((g_pairing_mode != 0U) && ((now - g_pairing_enter_tick) >= PAIRING_MODE_TIMEOUT_MS)) {
    g_pairing_mode = 0U;
    g_pairing_enter_tick = 0U;
    HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_RESET);
    DebugPrint("[PAIR] timeout\r\n");
#if APP_ROLE_TX_ONLY
    /* TX 对码超时指示：长亮 500ms（反馈期间独占 LED） */
    PairingLed_Feedback(0U);
#endif
  }

#if APP_ROLE_TX_ONLY
  /* 记录 L/R 各自按下时刻，用于“同时按下窗口”判定 */
  if ((l_raw != 0U) && (g_pair_l_down_tick == 0U)) {
    g_pair_l_down_tick = now;
  }
  if ((l_raw == 0U) && (g_pair_l_down_tick != 0U)) {
    g_pair_l_down_tick = 0U;
  }

  if ((r_raw != 0U) && (g_pair_r_down_tick == 0U)) {
    g_pair_r_down_tick = now;
  }
  if ((r_raw == 0U) && (g_pair_r_down_tick != 0U)) {
    g_pair_r_down_tick = 0U;
  }

  if ((l_raw != 0U) && (r_raw != 0U) && (g_pair_l_down_tick != 0U) && (g_pair_r_down_tick != 0U)) {
    uint32_t dt = (g_pair_l_down_tick >= g_pair_r_down_tick) ?
                  (g_pair_l_down_tick - g_pair_r_down_tick) :
                  (g_pair_r_down_tick - g_pair_l_down_tick);
    g_pair_combo_armed = (dt <= KEY_COMBO_SIMULT_MS) ? 1U : 0U;
  } else {
    g_pair_combo_armed = 0U;
  }

  raw = ((l_raw != 0U) && (r_raw != 0U) && (g_pair_combo_armed != 0U)) ? 1U : 0U;

  if ((g_pairing_mode == 0U) && (raw == 0U)) {
    return;
  }

  if (raw != g_pair_last_raw) {
    g_pair_last_raw = raw;
    g_pair_raw_change_tick = now;
  }

  if ((now - g_pair_raw_change_tick) < KEY_DEBOUNCE_MS) {
    return;
  }

  if (raw != g_pair_stable) {
    g_pair_stable = raw;

    DebugPrint("[KEY] L=");
    DebugPrintDec((uint16_t)l_raw);
    DebugPrint(" R=");
    DebugPrintDec((uint16_t)r_raw);
    DebugPrint(" LR=");
    DebugPrintDec((uint16_t)raw);
    DebugPrint("\r\n");

    if (g_pair_stable == 1U) {
      g_pair_press_start_tick = now;
      g_pair_long_done = 0U;
      DebugPrint("[PAIR] LR down\r\n");
    } else {
      g_pair_press_start_tick = 0U;
      g_pair_long_done = 0U;
      DebugPrint("[PAIR] LR up\r\n");
    }
  }

  if ((g_pair_stable == 1U) && (g_pair_long_done == 0U) && (g_pair_press_start_tick != 0U)) {
    uint32_t held = now - g_pair_press_start_tick;

    if (held >= KEY_LONG_MS) {
      g_pairing_mode = 1U;
      g_pairing_enter_tick = now;
      g_pair_led_tick = now;

      /* 进入对码时清空三键状态，避免“进入前已累计的单/双/长按事件”在后续被误执行。 */
      memset(&g_txk_l, 0, sizeof(g_txk_l));
      memset(&g_txk_m, 0, sizeof(g_txk_m));
      memset(&g_txk_r, 0, sizeof(g_txk_r));
      g_tx_evt_l = 0U;
      g_tx_evt_m = 0U;
      g_tx_evt_r = 0U;

      DebugPrint("[PAIR] enter (tx)\r\n");
      g_pair_long_done = 1U;
      g_tx_need_send = 1U;
    }
  }
#else
  (void)l_raw;
  (void)r_raw;
  (void)raw;
#endif
}

/* TX 进入低功耗前的统一收敛：
 * 1) RF 无条件下发睡眠
 * 2) 三线固定为 CSN=高、SCK=低、DATA=低，避免悬空/毛刺导致模块额外耗电
 * 3) 关闭串口，减少静态功耗 */
static void LowPowerDiag_LogRfPins(void)
{
#if LOWPOWER_DIAG_ENABLE
  uint8_t csn = (HAL_GPIO_ReadPin(RF_CSN_GPIO_Port, RF_CSN_Pin) == GPIO_PIN_SET) ? 1U : 0U;
  uint8_t sck = (HAL_GPIO_ReadPin(RF_SCK_GPIO_Port, RF_SCK_Pin) == GPIO_PIN_SET) ? 1U : 0U;
  uint8_t dat = (HAL_GPIO_ReadPin(RF_DATA_GPIO_Port, RF_DATA_Pin) == GPIO_PIN_SET) ? 1U : 0U;

  DebugPrint("[LP-RF-PIN] CSN=");
  DebugPrintDec(csn);
  DebugPrint(" SCK=");
  DebugPrintDec(sck);
  DebugPrint(" DAT=");
  DebugPrintDec(dat);
  DebugPrint("\r\n");
#endif
}

static void LowPowerDiag_LogWakeFlags(void)
{
#if LOWPOWER_DIAG_ENABLE
  uint8_t wufi = (__HAL_PWR_GET_FLAG(PWR_FLAG_WUFI) != 0U) ? 1U : 0U;
  uint8_t wuf1 = (__HAL_PWR_GET_FLAG(PWR_FLAG_WUF1) != 0U) ? 1U : 0U;
  uint8_t wuf2 = (__HAL_PWR_GET_FLAG(PWR_FLAG_WUF2) != 0U) ? 1U : 0U;
#if defined(PWR_FLAG_WUF3)
  uint8_t wuf3 = (__HAL_PWR_GET_FLAG(PWR_FLAG_WUF3) != 0U) ? 1U : 0U;
#else
  uint8_t wuf3 = 0U;
#endif
#if defined(PWR_FLAG_WUF4)
  uint8_t wuf4 = (__HAL_PWR_GET_FLAG(PWR_FLAG_WUF4) != 0U) ? 1U : 0U;
#else
  uint8_t wuf4 = 0U;
#endif
#if defined(PWR_FLAG_SBF)
  uint8_t sbf  = (__HAL_PWR_GET_FLAG(PWR_FLAG_SBF)  != 0U) ? 1U : 0U;
#else
  uint8_t sbf  = 0U;
#endif

  DebugPrint("[LP-WAKE] cnt=");
  DebugPrintDec((uint16_t)(g_lp_wake_cnt & 0xFFFFU));
  DebugPrint(" WUFI=");
  DebugPrintDec(wufi);
  DebugPrint(" WUF1=");
  DebugPrintDec(wuf1);
  DebugPrint(" WUF2=");
  DebugPrintDec(wuf2);
  DebugPrint(" WUF3=");
  DebugPrintDec(wuf3);
  DebugPrint(" WUF4=");
  DebugPrintDec(wuf4);
  DebugPrint(" SBF=");
  DebugPrintDec(sbf);
  DebugPrint("\r\n");
#endif
}

static void EnterTxLowPower(void)
{
  /* 诊断打印必须在串口关闭前执行 */
#if LOWPOWER_DIAG_ENABLE
  g_lp_enter_cnt++;
  DebugPrint("[LP-ENTER] cnt=");
  DebugPrintDec((uint16_t)(g_lp_enter_cnt & 0xFFFFU));
  DebugPrint("\r\n");
#endif

  RF_Link_Sleep();
  g_rf_sleeping = 1U;

  HAL_GPIO_WritePin(RF_CSN_GPIO_Port, RF_CSN_Pin, GPIO_PIN_SET);
  HAL_GPIO_WritePin(RF_SCK_GPIO_Port, RF_SCK_Pin, GPIO_PIN_RESET);
  HAL_GPIO_WritePin(RF_DATA_GPIO_Port, RF_DATA_Pin, GPIO_PIN_RESET);

#if LOWPOWER_DIAG_ENABLE
  LowPowerDiag_LogRfPins();
#endif

