Hzghero/motorcycle-led-remote-driver-v2/reference STM32c011f6p6-xl2400t/Core/Src/main.c
  /* 低功耗前关闭串口，减少外设静态功耗 */
  HAL_UART_DeInit(&huart1);

#if (TX_LOWPOWER_MODE == TX_LOWPOWER_MODE_STOP)
  /* STOP 前暂停 1ms Tick 与 TIM14，避免高频周期唤醒导致电流居高不下 */
  HAL_TIM_Base_Stop_IT(&htim14);
  HAL_SuspendTick();
#elif (TX_LOWPOWER_MODE == TX_LOWPOWER_MODE_STANDBY)
  /* STANDBY 前停掉 1ms Tick 与 TIM14，避免无意义中断活动 */
  HAL_TIM_Base_Stop_IT(&htim14);
  HAL_SuspendTick();

  /* 说明：WKUP 引脚在 PWR 视图不支持直接配置上下拉。
   * 进入 STANDBY 前通过 PWREx 固定关键引脚电平，避免待机期间悬空导致额外静态功耗：
   * - PA0  (WKUP1, M_KEY) 下拉：保持空闲低电平，仅在外部拉高时唤醒
   * - PA2  (WKUP4, R_KEY) 下拉：新右键引脚（Cube 无法直接配上下拉，这里手动兜底）
   * - PB6  (WKUP3, L_KEY) 下拉：新左键引脚（Cube 无法直接配上下拉，这里手动兜底）
   * - PA4  (RF_CSN)       上拉：保证 RF 片选在待机期间维持高电平（模块睡眠态）
   * - PA5/PA7             下拉：避免时钟/数据脚悬空抖动 */
  HAL_PWREx_DisableGPIOPullUp(PWR_GPIO_A, PWR_GPIO_BIT_0 | PWR_GPIO_BIT_2 | PWR_GPIO_BIT_5 | PWR_GPIO_BIT_7);
  HAL_PWREx_EnableGPIOPullDown(PWR_GPIO_A, PWR_GPIO_BIT_0 | PWR_GPIO_BIT_2 | PWR_GPIO_BIT_5 | PWR_GPIO_BIT_7);
  HAL_PWREx_DisableGPIOPullUp(PWR_GPIO_B, PWR_GPIO_BIT_6);
  HAL_PWREx_EnableGPIOPullDown(PWR_GPIO_B, PWR_GPIO_BIT_6);
  HAL_PWREx_EnableGPIOPullUp(PWR_GPIO_A, PWR_GPIO_BIT_4);
  HAL_PWREx_DisableGPIOPullDown(PWR_GPIO_A, PWR_GPIO_BIT_4);
  HAL_PWREx_EnablePullUpPullDownConfig();

#if LOWPOWER_DIAG_ENABLE
  DebugPrint("[LP-PWR-PULL] PA0=PD PA2=PD PB6=PD PA4=PU PA5=PD PA7=PD\r\n");
#endif

  /* 清理历史唤醒标志，避免“刚进就醒” */
  __HAL_PWR_CLEAR_FLAG(PWR_FLAG_WUF);

  /* 使能 WKUP1/3/4，保持“高电平唤醒”与当前按键高有效一致 */
  HAL_PWR_EnableWakeUpPin(PWR_WAKEUP_PIN1_HIGH);
#if defined(PWR_WAKEUP_PIN3_HIGH)
  HAL_PWR_EnableWakeUpPin(PWR_WAKEUP_PIN3_HIGH);
#endif
#if defined(PWR_WAKEUP_PIN4_HIGH)
  HAL_PWR_EnableWakeUpPin(PWR_WAKEUP_PIN4_HIGH);
#endif
#endif
}

/* TX 退出低功耗后的统一恢复：
 * STOP 唤醒后需要先恢复系统时钟，再恢复 Tick/TIM14，最后初始化串口。
 * SLEEP 唤醒仅需恢复串口。 */
static void ExitTxLowPower(void)
{
#if (TX_LOWPOWER_MODE == TX_LOWPOWER_MODE_STOP)
  SystemClock_Config();
  HAL_ResumeTick();
  HAL_TIM_Base_Start_IT(&htim14);
#endif
  MX_USART1_UART_Init();

  g_tx_lp_wake_tick = HAL_GetTick() + 1U;
#if LOWPOWER_DIAG_ENABLE
  DebugPrint("[TX-LP] wake_guard_ms=");
  DebugPrintDec((uint16_t)TX_LP_WAKE_GUARD_MS);
  DebugPrint("\r\n");
#endif

#if LOWPOWER_DIAG_ENABLE
  g_lp_wake_cnt++;
  LowPowerDiag_LogWakeFlags();
#endif

#if APP_ROLE_TX_ONLY
  g_tx_lp_wake_tick = HAL_GetTick() + 1U;
#endif
}

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */
#if APP_ROLE_TX_ONLY
  /* TX 启动早期先读取唤醒来源，再清理标志，避免证据被提前清掉 */
  g_boot_lp_wufi = (__HAL_PWR_GET_FLAG(PWR_FLAG_WUFI) != 0U) ? 1U : 0U;
  g_boot_lp_wuf1 = (__HAL_PWR_GET_FLAG(PWR_FLAG_WUF1) != 0U) ? 1U : 0U;
  g_boot_lp_wuf2 = (__HAL_PWR_GET_FLAG(PWR_FLAG_WUF2) != 0U) ? 1U : 0U;
#if defined(PWR_FLAG_WUF3)
  g_boot_lp_wuf3 = (__HAL_PWR_GET_FLAG(PWR_FLAG_WUF3) != 0U) ? 1U : 0U;
#else
  g_boot_lp_wuf3 = 0U;
#endif
#if defined(PWR_FLAG_WUF4)
  g_boot_lp_wuf4 = (__HAL_PWR_GET_FLAG(PWR_FLAG_WUF4) != 0U) ? 1U : 0U;
#else
  g_boot_lp_wuf4 = 0U;
#endif
#if defined(PWR_FLAG_SBF)
  g_boot_lp_sbf  = (__HAL_PWR_GET_FLAG(PWR_FLAG_SBF)  != 0U) ? 1U : 0U;
#else
  g_boot_lp_sbf  = 0U;
#endif

  /* 读取后再清标志，防止影响后续进入低功耗 */
  __HAL_PWR_CLEAR_FLAG(PWR_FLAG_WUF);
#if defined(PWR_FLAG_SBF)
  __HAL_PWR_CLEAR_FLAG(PWR_FLAG_SBF);
#endif
#endif

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_TIM14_Init();
  MX_USART1_UART_Init();
  MX_TIM1_Init();
  /* USER CODE BEGIN 2 */
  /* 2026-04-06 阶段摘要：本文件已完成三键唤醒重映射、WUF1/3/4 注入与 PWM 通道迁移；
   * 后续优化项见 docs/09-阶段成果总结_2026-04-06.md。 */
  HAL_TIM_Base_Start_IT(&htim14);
  DevId_LoadFromFlash();

#if APP_ROLE_TX_ONLY
  /* STANDBY 唤醒会走重启路径：这里统一拉起“唤醒活跃保护”起点，
   * 保证 TX_LP_WAKE_GUARD_MS 在主循环首轮就能生效。 */
  g_tx_lp_wake_tick = HAL_GetTick() + 1U;
#if LOWPOWER_DIAG_ENABLE
  DebugPrint("[TX-LP] wake_guard_ms=");
  DebugPrintDec((uint16_t)TX_LP_WAKE_GUARD_MS);
  DebugPrint("\r\n");
#endif
#endif
  DebugPrint("[FW] " FW_VERSION "\r\n");

  DebugPrint("[CFG] role=");
#if APP_ROLE_TX_ONLY
  DebugPrint("TX");
#else
  DebugPrint("RX");
#endif
  DebugPrint(" tx_only=");
#if APP_ROLE_TX_ONLY
  DebugPrint("1");
#else
  DebugPrint("0");
#endif
  DebugPrint(" rx_only=");
#if APP_ROLE_RX_ONLY
  DebugPrint("1");
#else
  DebugPrint("0");
#endif
  DebugPrint(" link_test=");
#if APP_RF_LINK_TEST
  DebugPrint("1");
#else
  DebugPrint("0");
#endif
  DebugPrint(" lowpower=");
#if (TX_LOWPOWER_MODE == TX_LOWPOWER_MODE_STOP)
  DebugPrint("STOP");
#elif (TX_LOWPOWER_MODE == TX_LOWPOWER_MODE_STANDBY)
  DebugPrint("STANDBY");
#else
  DebugPrint("SLEEP");
#endif
  DebugPrint(" rx_debounce_ms=");
  DebugPrintDec((uint16_t)RX_WIRE_DEBOUNCE_MS);
  DebugPrint(" rx_polarity=");
  DebugPrint(RX_WIRE_POLARITY_NAME);
  DebugPrint(" wuf_prio=1>3>4");
  DebugPrint(" horn_pending=last-wins");
  DebugPrint("\r\n");

  DebugPrint("[DEV] local=");
  DebugPrintHex((const uint8_t *)&g_dev_id_local, 2);
  DebugPrint(" paired=");
  DebugPrintHex((const uint8_t *)&g_dev_id_paired, 2);
  DebugPrint("\r\n");
  DebugPrint("[CMD] type HELP\r\n");

#if APP_ROLE_TX_ONLY
  DebugPrint("[BOOT-LP] WUFI=");
  DebugPrintDec(g_boot_lp_wufi);
  DebugPrint(" WUF1=");
  DebugPrintDec(g_boot_lp_wuf1);
  DebugPrint(" WUF2=");
  DebugPrintDec(g_boot_lp_wuf2);
  DebugPrint(" WUF3=");
  DebugPrintDec(g_boot_lp_wuf3);
  DebugPrint(" WUF4=");
  DebugPrintDec(g_boot_lp_wuf4);
  DebugPrint(" SBF=");
  DebugPrintDec(g_boot_lp_sbf);
  DebugPrint("\r\n");

#if TX_STATE_SAVE_COUNTER_LOG_ENABLE
  DebugPrint("[TX-STATE] save_count=");
  DebugPrintDec(g_tx_state_save_count);
  DebugPrint("\r\n");
#endif

  /* STANDBY 三键唤醒补偿（WKUP1/3/4）：
   * - WKUP1(PA0)=中键 M
   * - WKUP3(PB6)=左键 L
   * - WKUP4(PA2)=右键 R
   * 唤醒后默认挂起“对应单击补发”，按键扫描阶段再做按住过滤。 */
  g_tx_boot_wkup_pending_key = TLIGHT_KEY_NONE;
  if (g_boot_lp_wuf1 != 0U) {
    g_tx_boot_wkup_pending_key = TLIGHT_KEY_M;
    DebugPrint("[LP-WKUP] WKUP1 wake detected, pending M-key inject\r\n");
  } else if (g_boot_lp_wuf3 != 0U) {
    g_tx_boot_wkup_pending_key = TLIGHT_KEY_L;
    DebugPrint("[LP-WKUP] WKUP3 wake detected, pending L-key inject\r\n");
  } else if (g_boot_lp_wuf4 != 0U) {
    g_tx_boot_wkup_pending_key = TLIGHT_KEY_R;
    DebugPrint("[LP-WKUP] WKUP4 wake detected, pending R-key inject\r\n");
  }
#endif

