Hzghero/motorcycle-led-remote-driver-v2/reference STM32c011f6p6-xl2400t/Core/Src/main.c
      if ((g_link_last_rx_tick != 0U) && ((now - g_link_last_rx_tick) >= LINK_RX_TIMEOUT_MS) && (g_link_timeout_flag == 0U)) {
        g_link_timeout_flag = 1;
        DebugPrint("[RX-WARN] timeout > ");
        DebugPrintDec((uint16_t)LINK_RX_TIMEOUT_MS);
        DebugPrint("ms\r\n");
      }
#endif

      /* RX 三线输入业务（ACC/原车远光/喇叭） */
      RxWireInput_Poll(now);

      /* 驱动两路 PWM 输出（PA2=CH3, PA3=CH4） */
      Light_Tick(now);
#endif

#if APP_ROLE_TX_ONLY && TX_KEY_R_DEBUG_ONLY
      /* 右键本地调试模式：避免RF统计刷屏 */
#else
      /* 周期统计，避免日志刷屏 */
      LinkStats_Log(now);
#endif

#if APP_ROLE_TX_ONLY
    /* TX 角色：当业务空闲时进入低功耗，不再依赖历史太阳能“昼夜判定”逻辑 */
    {
      uint32_t now = HAL_GetTick();
      uint8_t tx_busy = 0U;

      if ((g_pairing_mode != 0U) || (g_tx_need_send != 0U) || (g_tx_burst_left > 0U)) {
        tx_busy = 1U;
      }

      /* 后台节流保存任务：活跃期间择机提交状态，避免每次按键直接写Flash。 */
      TxState_SaveWorker(now);
      if ((g_tx_rf_awake != 0U) && ((now - g_tx_last_send_tick) < LINK_TX_BURST_INTERVAL_MS)) {
        tx_busy = 1U;
      }
      /* 三键唤醒重映射后，PA2/PB6 在硬件端无内部上下拉：
       * 这里软件层继续使用唤醒保护窗口，避免唤醒后过快回睡。 */
      if ((g_tx_lp_wake_tick != 0U) && ((now - (g_tx_lp_wake_tick - 1U)) < TX_LP_WAKE_GUARD_MS)) {
        tx_busy = 1U;
      }
      if ((int32_t)(g_tx_post_event_hold_until_tick - now) > 0) {
        tx_busy = 1U;
      }

      {
        uint8_t l_now = TxKey_ReadRaw(L_KEY_Pin, L_KEY_GPIO_Port);
        uint8_t m_now = TxKey_ReadRaw(M_KEY_Pin, M_KEY_GPIO_Port);
        uint8_t r_now = TxKey_ReadRaw(R_KEY_Pin, R_KEY_GPIO_Port);

        /* 卡键保护：任一键连续按下超过阈值后，强制进低功耗直到全部释放。 */
        if ((l_now != 0U) || (m_now != 0U) || (r_now != 0U)) {
          if (g_tx_anykey_down_tick == 0U) {
            g_tx_anykey_down_tick = now;
          }

          if ((now - g_tx_anykey_down_tick) >= TX_STUCK_KEY_FORCE_SLEEP_MS) {
            if (g_tx_force_sleep_latched == 0U) {
              g_tx_force_sleep_latched = 1U;
              DebugPrint("[TX-LP] force_sleep_by_stuck_key\r\n");
            }
          }
        } else {
          if (g_tx_anykey_down_tick != 0U) {
            /* 全部按键释放边沿：只在这一刻刷新一次活动保持窗口。 */
            g_tx_key_active_until_tick = now + TX_LP_KEY_ACTIVE_HOLD_MS;
          }
          g_tx_anykey_down_tick = 0U;
          if (g_tx_force_sleep_latched != 0U) {
            g_tx_force_sleep_latched = 0U;
            g_tx_lp_wake_tick = now + 1U;
            DebugPrint("[TX-LP] stuck_key_released\r\n");
          }
        }

        if (g_tx_force_sleep_latched == 0U) {
          /* 正常策略：按键活动期间保持活跃，防止漏按。 */
          if ((l_now != 0U) || (m_now != 0U) || (r_now != 0U)) {
            tx_busy = 1U;
            g_tx_key_active_until_tick = now + TX_LP_KEY_ACTIVE_HOLD_MS;
          }

          if ((int32_t)(g_tx_key_active_until_tick - now) > 0) {
            tx_busy = 1U;
          }
        }
      }

      if (tx_busy != 0U) {
        /* 业务繁忙：若刚从低功耗唤醒，先恢复 RF 到 TX，再继续按键/发包 */
        if (g_rf_sleeping != 0U) {
          g_rf_sleeping = 0U;
          if (g_tx_rf_awake == 0U) {
            RF_Link_ConfigTx(RF_TX_CHANNEL);
            g_tx_rf_awake = 1U;
            g_tx_rf_wakeup_tick = now;
#if APP_RF_LINK_TEST
            DebugPrint("[RF] wake->tx (idle_exit)\r\n");
#endif
          }
        }
        HAL_Delay(1);
      } else {
        HAL_TIM_PWM_Stop(&htim1, TIM_CHANNEL_2);
        HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_RESET);

        /* 进入 STANDBY 前兜底保存：若仍有脏状态，立即提交，避免丢最后一次状态。 */
        if (g_tx_state_dirty != 0U) {
          if (TxState_SaveToFlash() != 0U) {
            g_tx_state_dirty = 0U;
            DebugPrint("[TX-STATE] save commit(pre-standby)\r\n");
          }
        }

        if(!g_rf_sleeping) {
          EnterTxLowPower();
        }

#if (TX_LOWPOWER_MODE == TX_LOWPOWER_MODE_STOP)
        HAL_PWREx_EnableFlashPowerDown(PWR_FLASHPD_STOP);
        HAL_PWR_EnterSTOPMode(PWR_MAINREGULATOR_ON, PWR_STOPENTRY_WFI);
        HAL_PWREx_DisableFlashPowerDown(PWR_FLASHPD_STOP);
        ExitTxLowPower();
#elif (TX_LOWPOWER_MODE == TX_LOWPOWER_MODE_STANDBY)
        HAL_PWR_EnterSTANDBYMode();
        /* 理论上不会执行到这里；若异常返回，做一次兜底恢复 */
        ExitTxLowPower();
#else
        HAL_PWR_EnterSLEEPMode(PWR_MAINREGULATOR_ON, PWR_SLEEPENTRY_WFI);
        ExitTxLowPower();
#endif
      }
    }
#else
    /* RX 角色：保持主循环常规调度 */
    HAL_Delay(1);
#endif
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  __HAL_FLASH_SET_LATENCY(FLASH_LATENCY_0);

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSE;
  RCC_ClkInitStruct.SYSCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_APB1_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief TIM1 Initialization Function
  * @param None
  * @retval None
  */
static void MX_TIM1_Init(void)
{

  /* USER CODE BEGIN TIM1_Init 0 */

  /* USER CODE END TIM1_Init 0 */

  TIM_MasterConfigTypeDef sMasterConfig = {0};
  TIM_OC_InitTypeDef sConfigOC = {0};
  TIM_BreakDeadTimeConfigTypeDef sBreakDeadTimeConfig = {0};

  /* USER CODE BEGIN TIM1_Init 1 */

  /* USER CODE END TIM1_Init 1 */
  htim1.Instance = TIM1;
  htim1.Init.Prescaler = 0;
  htim1.Init.CounterMode = TIM_COUNTERMODE_UP;
  htim1.Init.Period = 1199;
  htim1.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
  htim1.Init.RepetitionCounter = 0;
  htim1.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_ENABLE;
  if (HAL_TIM_PWM_Init(&htim1) != HAL_OK)
  {
    Error_Handler();
  }
  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
  sMasterConfig.MasterOutputTrigger2 = TIM_TRGO2_RESET;
  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
  if (HAL_TIMEx_MasterConfigSynchronization(&htim1, &sMasterConfig) != HAL_OK)
  {
    Error_Handler();
  }
  sConfigOC.OCMode = TIM_OCMODE_PWM1;
  sConfigOC.Pulse = 115;
  sConfigOC.OCPolarity = TIM_OCPOLARITY_HIGH;
  sConfigOC.OCNPolarity = TIM_OCNPOLARITY_HIGH;
  sConfigOC.OCFastMode = TIM_OCFAST_ENABLE;
  sConfigOC.OCIdleState = TIM_OCIDLESTATE_RESET;
  sConfigOC.OCNIdleState = TIM_OCNIDLESTATE_RESET;
  if (HAL_TIM_PWM_ConfigChannel(&htim1, &sConfigOC, TIM_CHANNEL_2) != HAL_OK)
  {
    Error_Handler();
  }
  sBreakDeadTimeConfig.OffStateRunMode = TIM_OSSR_DISABLE;
  sBreakDeadTimeConfig.OffStateIDLEMode = TIM_OSSI_DISABLE;
  sBreakDeadTimeConfig.LockLevel = TIM_LOCKLEVEL_OFF;
  sBreakDeadTimeConfig.DeadTime = 0;
  sBreakDeadTimeConfig.BreakState = TIM_BREAK_DISABLE;
  sBreakDeadTimeConfig.BreakPolarity = TIM_BREAKPOLARITY_HIGH;
  sBreakDeadTimeConfig.BreakFilter = 0;
  sBreakDeadTimeConfig.BreakAFMode = TIM_BREAK_AFMODE_INPUT;
  sBreakDeadTimeConfig.Break2State = TIM_BREAK2_DISABLE;
  sBreakDeadTimeConfig.Break2Polarity = TIM_BREAK2POLARITY_HIGH;
  sBreakDeadTimeConfig.Break2Filter = 0;
  sBreakDeadTimeConfig.Break2AFMode = TIM_BREAK_AFMODE_INPUT;
  sBreakDeadTimeConfig.AutomaticOutput = TIM_AUTOMATICOUTPUT_DISABLE;
  if (HAL_TIMEx_ConfigBreakDeadTime(&htim1, &sBreakDeadTimeConfig) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN TIM1_Init 2 */

  /* USER CODE END TIM1_Init 2 */
  HAL_TIM_MspPostInit(&htim1);

