Hzghero/motorcycle-led-remote-driver-v2/reference STM32c011f6p6-xl2400t/Core/Src/main.c
  /* 对码窗口期间：LED 由对码逻辑独占，普通短亮提示不允许抢占 */
  g_led_state = 0;

  if ((now - g_pair_led_tick) >= 200U) {
    g_pair_led_tick = now;
    HAL_GPIO_TogglePin(LED_GPIO_Port, LED_Pin);
  }
}

static void PairingLed_Feedback(uint8_t success)
{
  /* 反馈期间关闭普通短亮状态，防止抢占 */
  g_led_state = 0;
  g_pair_fb_tick = HAL_GetTick();
  g_pair_fb_step = 0U;

  if (success != 0U) {
    g_pair_fb_state = PAIR_FB_SUCCESS;
    HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_SET);
  } else {
    g_pair_fb_state = PAIR_FB_FAIL;
    HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_SET);
  }
}

/* RX 三线输入处理（冲突优先级状态表）
 * P0: ACC=0 -> 强制OFF（最高优先级）
 * P1: ACC=1 且 HORN=1 -> 强制爆闪（模式4）
 * P2: HORN 下降沿释放 -> 回到黄线状态（HI=1远光/HI=0近光）
 * P3: HORN=0 时，黄线边沿控制近/远光（上升=远光，下降=近光）
 *     其中“黄线首次生效”需先在窗口内出现两次边沿（双触发）后才解锁；
 *     解锁后按边沿正常生效。该规则兼容正/负逻辑极性配置。
 * P4: 遥控命令仅在未触发 P0/P1 强制态时生效（已落地）。 */
static void RxWireInput_Poll(uint32_t now)
{
#if APP_ROLE_RX_ONLY
  uint8_t acc_raw  = (HAL_GPIO_ReadPin(RX_ACC_IN_PORT, RX_ACC_IN_PIN) == RX_IN_ACTIVE_LEVEL) ? 1U : 0U;
  uint8_t hi_raw   = (HAL_GPIO_ReadPin(RX_CAR_HI_IN_PORT, RX_CAR_HI_IN_PIN) == RX_IN_ACTIVE_LEVEL) ? 1U : 0U;
  uint8_t horn_raw = (HAL_GPIO_ReadPin(RX_HORN_IN_PORT, RX_HORN_IN_PIN) == RX_IN_ACTIVE_LEVEL) ? 1U : 0U;
  uint8_t acc = g_rx_acc_last;
  uint8_t hi = g_rx_hi_last;
  uint8_t horn = g_rx_horn_last;

  if (acc_raw != g_rx_acc_raw_last) {
    g_rx_acc_raw_last = acc_raw;
    g_rx_acc_raw_change_tick = now;
  }
  if ((now - g_rx_acc_raw_change_tick) >= RX_WIRE_DEBOUNCE_MS) {
    acc = acc_raw;
  }

  if (hi_raw != g_rx_hi_raw_last) {
    g_rx_hi_raw_last = hi_raw;
    g_rx_hi_raw_change_tick = now;
  }
  if ((now - g_rx_hi_raw_change_tick) >= RX_WIRE_DEBOUNCE_MS) {
    hi = hi_raw;
  }

  if (horn_raw != g_rx_horn_raw_last) {
    g_rx_horn_raw_last = horn_raw;
    g_rx_horn_raw_change_tick = now;
  }
  if ((now - g_rx_horn_raw_change_tick) >= RX_WIRE_DEBOUNCE_MS) {
    horn = horn_raw;
  }

  if (acc == 0U) {
    g_rx_horn_active = 0U;
    g_light_mode = TLIGHT_MODE_OFF;

    /* ACC 关闭时，重置黄线首次双触发门限；下次ACC有效后重新判定首次双触发 */
    g_rx_hi_gate_unlocked = 0U;
    g_rx_hi_edge_cnt = 0U;
    g_rx_hi_first_edge_tick = 0U;

    g_rx_acc_last = acc;
    g_rx_hi_last = hi;
    g_rx_horn_last = horn;
    return;
  }

  if ((horn != 0U) && (g_rx_horn_last == 0U)) {
    /* 喇叭上升沿：先快照当前状态，再进入爆闪覆盖态 */
    g_rx_pre_horn_mode = g_light_mode;
    g_rx_pre_horn_bright = g_light_bright;
    g_rx_remote_pending_valid = 0U;

    g_rx_horn_active = 1U;
    g_light_mode = 4U; /* 仅作状态兼容标记；实际爆闪由 HORN 独立 50/50ms 逻辑驱动 */
    g_light_bright = TLIGHT_BRIGHT_100;
  }
  if ((horn == 0U) && (g_rx_horn_last != 0U)) {
    g_rx_horn_active = 0U;

    /* 喇叭释放优先级：
     * 1) HORN期间若有遥控pending，优先应用pending
     * 2) 否则恢复到HORN触发前快照状态 */
    if (g_rx_remote_pending_valid != 0U) {
      g_light_mode = g_rx_remote_pending_mode;
      g_light_bright = g_rx_remote_pending_bright;
      g_rx_remote_pending_valid = 0U;
    } else {
      g_light_mode = g_rx_pre_horn_mode;
      g_light_bright = g_rx_pre_horn_bright;
    }
  }

  if (g_rx_horn_active == 0U) {
    uint8_t hi_edge = (uint8_t)((hi != g_rx_hi_last) ? 1U : 0U);

    if (g_rx_hi_gate_unlocked == 0U) {
      if (hi_edge != 0U) {
        if (g_rx_hi_edge_cnt == 0U) {
          g_rx_hi_edge_cnt = 1U;
          g_rx_hi_first_edge_tick = now;
        } else {
          if ((now - g_rx_hi_first_edge_tick) <= RX_HI_FIRST_DBL_MS) {
            g_rx_hi_gate_unlocked = 1U;
            g_rx_hi_edge_cnt = 0U;
            g_rx_hi_first_edge_tick = 0U;
          } else {
            /* 超窗：以当前边沿作为新的第一次 */
            g_rx_hi_edge_cnt = 1U;
            g_rx_hi_first_edge_tick = now;
          }
        }
      }
    }

    if (g_rx_hi_gate_unlocked != 0U) {
      if ((hi != 0U) && (g_rx_hi_last == 0U)) {
        g_light_mode = 2U; /* 黄线上升沿：远光 */
      }
      if ((hi == 0U) && (g_rx_hi_last != 0U)) {
        g_light_mode = 1U; /* 黄线下降沿：近光 */
      }
    }
  }

  g_rx_acc_last = acc;
  g_rx_hi_last = hi;
  g_rx_horn_last = horn;
#else
  (void)now;
#endif
}

static uint8_t TxKey_ReadRaw(uint16_t pin, GPIO_TypeDef *port)
{
  return (HAL_GPIO_ReadPin(port, pin) == KEY_ACTIVE_LEVEL) ? 1U : 0U;
}

static uint8_t TxKey_Update(TxKeyState_t *ks, uint8_t raw, uint32_t now, uint8_t tick_1ms, uint8_t *evt_single, uint8_t *evt_double, uint8_t *evt_long)
{
  uint8_t changed = 0U;
  *evt_single = 0U;
  *evt_double = 0U;
  *evt_long = 0U;

  /* 对齐参考工程：按键识别仅在 1ms 节拍中推进，避免主循环阻塞造成采样漂移 */
  if (tick_1ms == 0U) {
    return 0U;
  }

  if (raw != ks->last_raw) {
    ks->last_raw = raw;
    ks->raw_change_tick = now;
  }

  if ((now - ks->raw_change_tick) >= KEY_DEBOUNCE_MS) {
    if (ks->stable_level != raw) {
      ks->stable_level = raw;
      changed = 1U;

      if (ks->stable_level != 0U) {
        /* 稳定按下 */
        ks->press_start_tick = now;
        ks->long_reported = 0U;

#if KEY_TX_DOUBLE_ENABLE
        if (ks->click_pending != 0U) {
          uint32_t gap = now - ks->first_click_tick;
          if (gap <= KEY_TX_DBL_MS) {
            *evt_double = 1U;
            ks->click_pending = 0U;
            ks->suppress_release_after_double = 1U;
          } else {
            /* 第二次按下超窗：上一击补发单击，本次按下作为新一轮 */
            *evt_single = 1U;
            ks->click_pending = 0U;
          }
        }
#endif
      } else {
        /* 稳定松开 */
        uint32_t press_dur = 0U;
        if (ks->press_start_tick != 0U) {
          press_dur = now - ks->press_start_tick;
        }
        ks->last_press_duration_ms = press_dur;

        if (ks->suppress_release_after_double != 0U) {
          ks->suppress_release_after_double = 0U;
          ks->press_start_tick = 0U;
          return changed;
        }

        if (ks->long_reported == 0U) {
#if KEY_TX_DOUBLE_ENABLE
          ks->click_pending = 1U;
          ks->first_click_tick = now;
#else
          *evt_single = 1U;
#endif
        }

        ks->press_start_tick = 0U;
      }
    }
  }

  if ((ks->stable_level != 0U) && (ks->long_reported == 0U) && (ks->press_start_tick != 0U)) {
    if ((now - ks->press_start_tick) >= KEY_TX_LONG_MS) {
      ks->long_reported = 1U;
      ks->click_pending = 0U;
      ks->suppress_release_after_double = 0U;
      *evt_long = 1U;
    }
  }

