Hzghero/motorcycle-led-remote-driver-v2/reference STM32c011f6p6-xl2400t/Core/Src/main.c
#if KEY_TX_DOUBLE_ENABLE
  if ((ks->click_pending != 0U) && ((now - ks->first_click_tick) > KEY_TX_DBL_MS)) {
    ks->click_pending = 0U;
    *evt_single = 1U;
  }
#endif

  return changed;
}

static uint16_t GetPhase1ms(uint16_t period_ms)
{
  uint16_t phase = g_phase_1ms;
  if (period_ms == 0U) return 0U;
  return (uint16_t)(phase % period_ms);
}

void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  if (htim->Instance == TIM14) {
    g_phase_1ms++;
  }
}

static void Tx_ScheduleBurst(void)
{
  g_tx_need_send = 1U;
  if (g_tx_first_event_done == 0U) {
    g_tx_burst_left = LINK_TX_BOOT_BURST_COUNT;
    g_tx_first_event_done = 1U;
  } else {
    g_tx_burst_left = LINK_TX_EVENT_BURST_COUNT;
  }
}

static void Tx_DoOff(const char *key_name, const char *trig)
{
  g_tx_is_off = 1U;
  g_tx_in_effect = 0U;
  g_tx_mode = 0U;
  g_tx_left_all_on_armed = 0U;

  DebugPrint("[TX-OFF] key=");
  DebugPrint(key_name);
  DebugPrint(" trig=");
  DebugPrint(trig);
  DebugPrint("\r\n");
}

static void Tx_OnFromOff_BySingle(uint8_t key)
{
  g_tx_is_off = 0U;
  g_tx_last_key = key;
  g_tx_last_trig = TLIGHT_TRIG_SINGLE;

  if (key == TLIGHT_KEY_R) { /* 右键 */
    g_tx_in_effect = 1U;
    g_tx_effect_mode = 4U;
    g_tx_mode = g_tx_effect_mode;
    DebugPrint("[TX-ON] key=R trig=single to=effect1\r\n");
  } else {
    g_tx_in_effect = 0U;
    g_tx_basic_mode = 1U;
    g_tx_mode = g_tx_basic_mode;
    if (key == TLIGHT_KEY_L) {
      DebugPrint("[TX-ON] key=L trig=single to=basic1\r\n");
    } else {
      DebugPrint("[TX-ON] key=M trig=single to=basic1\r\n");
    }
  }
}

static void Tx_HandleSingle(uint8_t key)
{
  if (g_tx_is_off != 0U) {
    Tx_OnFromOff_BySingle(key);
    return;
  }

  g_tx_last_key = key;
  g_tx_last_trig = TLIGHT_TRIG_SINGLE;

  if (key == TLIGHT_KEY_L) { /* 左键 */
    if (g_tx_in_effect != 0U) {
      g_tx_in_effect = 0U;
      g_tx_basic_mode = 1U;
      g_tx_mode = g_tx_basic_mode;
    } else {
      g_tx_basic_mode++;
      if (g_tx_basic_mode > 2U) g_tx_basic_mode = 1U;
      g_tx_mode = g_tx_basic_mode;
    }
  } else if (key == TLIGHT_KEY_M) { /* 中键 */
    g_tx_bright++;
    if (g_tx_bright > TLIGHT_BRIGHT_100) g_tx_bright = TLIGHT_BRIGHT_30;
  } else { /* 右键 */
    g_tx_in_effect = 1U;
    g_tx_effect_mode++;
    if (g_tx_effect_mode > 7U) g_tx_effect_mode = 4U;
    g_tx_mode = g_tx_effect_mode;
  }
}

/* TX 双击/长按入口：
 * - 左键：仅做“近光(1) <-> 同亮(3)”循环，不熄灯（OFF时可拉起到basic1）
 * - 右键：用于熄灯；全灭状态下再次触发无效
 * - 中键：双击/长按等效单击（不熄灯） */
static void Tx_HandleOffTrigger(uint8_t key, const char *trig)
{
  uint8_t trig_code = TLIGHT_TRIG_NONE;

  if ((trig[0] == 'd') || (trig[0] == 'D')) {
    trig_code = TLIGHT_TRIG_DOUBLE;
  } else {
    trig_code = TLIGHT_TRIG_LONG;
  }

  /* 左键：双击/长按只做 近光 <-> 同亮 循环，不参与熄灯 */
  if (key == TLIGHT_KEY_L) {
    if (g_tx_is_off != 0U) {
      g_tx_is_off = 0U;
      g_tx_in_effect = 0U;
      g_tx_basic_mode = 1U;
      g_tx_mode = 1U;
      g_tx_last_key = TLIGHT_KEY_L;
      g_tx_last_trig = trig_code;
      DebugPrint("[TX-KEY] key=L trig=");
      DebugPrint(trig);
      DebugPrint(" action=off_to_basic1\r\n");
      return;
    }

    g_tx_in_effect = 0U;
    if (g_tx_mode == 3U) {
      g_tx_basic_mode = 1U;
      g_tx_mode = 1U;
      DebugPrint("[TX-KEY] key=L trig=");
      DebugPrint(trig);
      DebugPrint(" action=all_on_to_basic1\r\n");
    } else {
      g_tx_basic_mode = 3U;
      g_tx_mode = 3U;
      DebugPrint("[TX-KEY] key=L trig=");
      DebugPrint(trig);
      DebugPrint(" action=basic1_to_all_on\r\n");
    }
    g_tx_last_key = TLIGHT_KEY_L;
    g_tx_last_trig = trig_code;
    return;
  }

  /* 中键：双击/长按等效单击（亮度循环，不熄灯） */
  if (key == TLIGHT_KEY_M) {
    Tx_HandleSingle(TLIGHT_KEY_M);
    DebugPrint("[TX-KEY] key=M trig=");
    DebugPrint(trig);
    DebugPrint(" action=as_single\r\n");
    return;
  }

  /* 右键：双击/长按=全灭；但全灭状态下再次触发无效 */
  if (key == TLIGHT_KEY_R) {
    if (g_tx_is_off != 0U) {
      DebugPrint("[TX-KEY] key=R trig=");
      DebugPrint(trig);
      DebugPrint(" action=off_ignore\r\n");
      return;
    }

    g_tx_last_key = key;
    g_tx_last_trig = trig_code;
    Tx_DoOff("R", trig);
    return;
  }
}

static void TxKeys_Process(uint32_t now, uint8_t tick_1ms)
{
#if APP_ROLE_TX_ONLY
  uint8_t changed = 0U;
  uint8_t s = 0U, d = 0U, l = 0U;
  uint8_t l_raw_now = (HAL_GPIO_ReadPin(L_KEY_GPIO_Port, L_KEY_Pin) == KEY_ACTIVE_LEVEL) ? 1U : 0U;
  uint8_t r_raw_now = (HAL_GPIO_ReadPin(R_KEY_GPIO_Port, R_KEY_Pin) == KEY_ACTIVE_LEVEL) ? 1U : 0U;

  /* L+R 组合键对码候选/对码中：屏蔽单键业务识别，避免先触发业务再进入对码。
   * 仅在“当前物理上仍同时按下且组合窗口有效”时屏蔽，避免组合键抬起后因状态滞留导致业务假死。 */
  {
    uint8_t guard_on = 0U;
    if (g_pairing_mode != 0U) {
      guard_on = 1U;
    } else if ((l_raw_now != 0U) && (r_raw_now != 0U) && (g_pair_combo_armed != 0U) && (g_pair_long_done == 0U)) {
      guard_on = 1U;
    }

    if (guard_on != g_pair_guard_log_state) {
      g_pair_guard_log_state = guard_on;
      if (guard_on != 0U) {
        DebugPrint("[PAIR-GUARD] on\r\n");
      } else {
        DebugPrint("[PAIR-GUARD] off\r\n");
      }
    }

    if (guard_on != 0U) {
      return;
    }
  }

#if TX_KEY_R_DEBUG_ONLY
  (void)TxKey_Update(&g_txk_r, TxKey_ReadRaw(R_KEY_Pin, R_KEY_GPIO_Port), now, tick_1ms, &s, &d, &l);
  if (s) {
    g_rdbg_evt_single = 1U;
    g_rdbg_single_cnt++;
    DebugPrint("[RDBG] single cnt=");
    DebugPrintDec((uint16_t)(g_rdbg_single_cnt & 0xFFFFU));
    DebugPrint(" dur=");
    DebugPrintDec((uint16_t)g_txk_r.last_press_duration_ms);
    DebugPrint("ms\r\n");
  }
  if (d) {
    g_rdbg_evt_double = 1U;
    g_rdbg_double_cnt++;
    DebugPrint("[RDBG] double cnt=");
    DebugPrintDec((uint16_t)(g_rdbg_double_cnt & 0xFFFFU));
    DebugPrint("\r\n");
  }
  if (l) {
    g_rdbg_evt_long = 1U;
    g_rdbg_long_cnt++;
    DebugPrint("[RDBG] long cnt=");
    DebugPrintDec((uint16_t)(g_rdbg_long_cnt & 0xFFFFU));
    DebugPrint(" hold>=");
    DebugPrintDec((uint16_t)KEY_TX_LONG_MS);
    DebugPrint("ms\r\n");
  }
#else
  (void)TxKey_Update(&g_txk_l, TxKey_ReadRaw(L_KEY_Pin, L_KEY_GPIO_Port), now, tick_1ms, &s, &d, &l);
  if (s) { g_tx_evt_l = 1U; }
  if (d) { Tx_HandleOffTrigger(0U, "double"); changed = 1U; }
  if (l) { Tx_HandleOffTrigger(0U, "long"); changed = 1U; }

  (void)TxKey_Update(&g_txk_m, TxKey_ReadRaw(M_KEY_Pin, M_KEY_GPIO_Port), now, tick_1ms, &s, &d, &l);
  if (s) { g_tx_evt_m = 1U; }
  if (d) { Tx_HandleOffTrigger(1U, "double"); changed = 1U; }
  if (l) { Tx_HandleOffTrigger(1U, "long"); changed = 1U; }

