Hzghero/motorcycle-led-remote-driver-v2/reference STM32c011f6p6-xl2400t/Core/Src/main.c
  (void)TxKey_Update(&g_txk_r, TxKey_ReadRaw(R_KEY_Pin, R_KEY_GPIO_Port), now, tick_1ms, &s, &d, &l);
  if (s) { g_tx_evt_r = 1U; }
  if (d) { Tx_HandleOffTrigger(2U, "double"); changed = 1U; }
  if (l) { Tx_HandleOffTrigger(2U, "long"); changed = 1U; }

  if (g_tx_evt_l != 0U) {
    g_tx_evt_l = 0U;
    Tx_HandleSingle(0U);
    changed = 1U;
  }

  if (g_tx_evt_m != 0U) {
    g_tx_evt_m = 0U;
    Tx_HandleSingle(1U);
    changed = 1U;
  }

  if (g_tx_evt_r != 0U) {
    g_tx_evt_r = 0U;
    Tx_HandleSingle(2U);
    changed = 1U;
  }

  /* 低功耗唤醒补偿（三键）：
   * 仅在对应按键已释放时补发单击；若仍按下则判定为长按场景并跳过注入。 */
  if (g_tx_boot_wkup_pending_key != TLIGHT_KEY_NONE) {
    uint8_t wake_key = g_tx_boot_wkup_pending_key;
    uint8_t key_now = 0U;

    g_tx_boot_wkup_pending_key = TLIGHT_KEY_NONE;
    if (wake_key == TLIGHT_KEY_L) {
      key_now = TxKey_ReadRaw(L_KEY_Pin, L_KEY_GPIO_Port);
    } else if (wake_key == TLIGHT_KEY_M) {
      key_now = TxKey_ReadRaw(M_KEY_Pin, M_KEY_GPIO_Port);
    } else {
      key_now = TxKey_ReadRaw(R_KEY_Pin, R_KEY_GPIO_Port);
    }

    if (key_now == 0U) {
      Tx_HandleSingle(wake_key);
      changed = 1U;
      DebugPrint("[LP-WKUP] inject key=");
      if (wake_key == TLIGHT_KEY_L) DebugPrint("L");
      else if (wake_key == TLIGHT_KEY_M) DebugPrint("M");
      else DebugPrint("R");
      DebugPrint(" trig=single\r\n");
    } else {
      DebugPrint("[LP-WKUP] hold_keep, skip inject\r\n");
    }
  }

  if (changed != 0U) {
    Tx_ScheduleBurst();
    /* 事件后保持一段活跃窗口，避免 STANDBY 场景下“发完立刻回睡”造成 RX 偶发漏收。 */
    g_tx_post_event_hold_until_tick = now + TX_POST_EVENT_HOLD_MS;
    /* 标记状态变更：由后台节流任务统一提交，降低Flash写入频率。 */
    TxState_MarkDirty(now);

    if (g_pairing_mode == 0U) {
      HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_SET);
      g_led_state = 1;
      g_led_on_tick = HAL_GetTick();
    }

    DebugPrint("[TX-KEY] mode=");
    DebugPrintDec((uint16_t)g_tx_mode);
    DebugPrint(" bright=");
    DebugPrintDec((uint16_t)g_tx_bright);
    DebugPrint(" key=");
    DebugPrintDec((uint16_t)g_tx_last_key);
    DebugPrint(" trig=");
    DebugPrintDec((uint16_t)g_tx_last_trig);
    DebugPrint(" off=");
    DebugPrintDec((uint16_t)g_tx_is_off);
    DebugPrint(" dev=");
    DebugPrintHex((const uint8_t *)&g_dev_id_local, 2);
    DebugPrint("\r\n");
  }
#endif
#else
  (void)now;
  (void)tick_1ms;
  /* RX 构建保持空实现 */
#endif
}

/* 非阻塞灯效状态机：只依赖 HAL_GetTick() */
static void TxKeyR_DebugLedTask(uint32_t now)
{
#if APP_ROLE_TX_ONLY && TX_KEY_R_DEBUG_ONLY
  if (g_rdbg_evt_double != 0U) {
    g_rdbg_evt_double = 0U;
    g_rdbg_evt_single = 0U;
    g_rdbg_led_state = RDBG_LED_DBL_HOLD;
    g_rdbg_led_mark = now;
    HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_SET);
    DebugPrint("[RDBG-LED] DOUBLE hold_on\r\n");
    return;
  }

  if (g_rdbg_evt_long != 0U) {
    g_rdbg_evt_long = 0U;
    g_rdbg_evt_single = 0U;
    g_rdbg_led_state = RDBG_LED_LONG_ON;
    g_rdbg_led_mark = now;
    g_rdbg_led_long_remain = 3U;
    HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_SET);
    DebugPrint("[RDBG-LED] LONG blink3_start\r\n");
    return;
  }

  if (g_rdbg_evt_single != 0U) {
    g_rdbg_evt_single = 0U;
    g_rdbg_led_state = RDBG_LED_SINGLE_ON;
    g_rdbg_led_mark = now;
    HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_SET);
    DebugPrint("[RDBG-LED] SINGLE blink1_start\r\n");
    return;
  }

  if (g_rdbg_led_state == RDBG_LED_SINGLE_ON) {
    if ((now - g_rdbg_led_mark) >= RDBG_LED_STEP_MS) {
      HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_RESET);
      g_rdbg_led_state = RDBG_LED_IDLE;
      DebugPrint("[RDBG-LED] SINGLE done\r\n");
    }
    return;
  }

  if (g_rdbg_led_state == RDBG_LED_DBL_HOLD) {
    if ((now - g_rdbg_led_mark) >= RDBG_LED_DBL_HOLD_MS) {
      HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_RESET);
      g_rdbg_led_state = RDBG_LED_IDLE;
    }
    return;
  }

  if (g_rdbg_led_state == RDBG_LED_LONG_ON) {
    if ((now - g_rdbg_led_mark) >= RDBG_LED_STEP_MS) {
      HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_RESET);
      g_rdbg_led_mark = now;
      g_rdbg_led_state = RDBG_LED_LONG_OFF;
      /* pulse_off log disabled to reduce UART blocking */
    }
    return;
  }

  if (g_rdbg_led_state == RDBG_LED_LONG_OFF) {
    if ((now - g_rdbg_led_mark) >= RDBG_LED_STEP_MS) {
      if (g_rdbg_led_long_remain > 1U) {
        g_rdbg_led_long_remain--;
        HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_SET);
        g_rdbg_led_mark = now;
        g_rdbg_led_state = RDBG_LED_LONG_ON;
        /* pulse_on log disabled to reduce UART blocking */
      } else {
        g_rdbg_led_long_remain = 0U;
        g_rdbg_led_state = RDBG_LED_IDLE;
        /* long done log disabled to reduce UART blocking */
      }
    }
    return;
  }

  HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_RESET);
#else
  (void)now;
#endif
}

/* 非阻塞灯效状态机：基于 TIM14 1ms 节拍相位锁定 */
static void Light_Tick(uint32_t now)
{
  const uint16_t base = Bright_ToPulse(g_light_bright);

  /* 对齐说明书参数（统一从宏读取，便于快速调参） */
  const uint16_t fast_ms = FX4_FLASH_HALF_PERIOD_MS;    /* mode4 */
  const uint16_t alt_ms  = FX5_ALT_HALF_PERIOD_MS;      /* mode5 */
  const uint16_t wheel_ms = FX7_WHEEL_HALF_PERIOD_MS;   /* mode7（旧参数保留，不再用于输出节拍） */
  const uint16_t breath_ms = FX6_BREATH_PERIOD_MS;      /* mode6 */

  uint8_t mask = 0U;
  uint16_t pulse = 0U;

#if APP_ROLE_RX_ONLY
  /* 蓝线(HORN)独立爆闪：固定 50ms 亮 / 50ms 灭，不复用右键模式语义 */
  if (g_rx_horn_active != 0U) {
    uint16_t phase = GetPhase1ms((uint16_t)(HORN_FLASH_HALF_PERIOD_MS * 2U));
    mask = (uint8_t)(CH_L_HI_MASK | CH_R_HI_MASK);
    pulse = (phase < HORN_FLASH_HALF_PERIOD_MS) ? base : 0U;
    Channel_ApplyMask(mask);
    PwmGlobal_Set(pulse);
    return;
  }

  /* RX 对码结果反馈：仅短时覆盖近光输出，结束后自动回归原业务态。 */
  if (g_rx_pair_fb_state == RX_PAIR_FB_SUCCESS_HOLD) {
    mask = (uint8_t)(CH_L_LO_MASK | CH_R_LO_MASK);
    pulse = base;
    Channel_ApplyMask(mask);
    PwmGlobal_Set(pulse);
    if ((now - g_rx_pair_fb_tick) >= RX_PAIR_SUCCESS_HOLD_MS) {
      g_rx_pair_fb_state = RX_PAIR_FB_NONE;
      g_rx_pair_fb_step = 0U;
    }
    return;
  }

