Hzghero/motorcycle-led-remote-driver-v2/reference STM32c011f6p6-xl2400t/Core/Src/main.c
  if (g_rx_pair_fb_state == RX_PAIR_FB_FAIL_FLASH) {
    uint8_t on_phase = (uint8_t)((g_rx_pair_fb_step & 0x01U) == 0U);
    mask = (uint8_t)(CH_L_LO_MASK | CH_R_LO_MASK);
    pulse = (on_phase != 0U) ? base : 0U;
    Channel_ApplyMask(mask);
    PwmGlobal_Set(pulse);

    if ((now - g_rx_pair_fb_tick) >= RX_PAIR_FAIL_FLASH_HALF_MS) {
      g_rx_pair_fb_tick = now;
      g_rx_pair_fb_step++;
      if (g_rx_pair_fb_step >= RX_PAIR_FAIL_FLASH_TOGGLE_CNT) {
        g_rx_pair_fb_state = RX_PAIR_FB_NONE;
        g_rx_pair_fb_step = 0U;
      }
    }
    return;
  }
#endif

  (void)now;

  switch (g_light_mode) {
    case 1: /* 近光常亮 */
      mask = (uint8_t)(CH_L_LO_MASK | CH_R_LO_MASK);
      pulse = base;
      break;

    case 2: /* 远光常亮 */
      mask = (uint8_t)(CH_L_HI_MASK | CH_R_HI_MASK);
      pulse = base;
      break;

    case 3: /* 远近同亮 */
      mask = (uint8_t)(CH_L_HI_MASK | CH_L_LO_MASK | CH_R_HI_MASK | CH_R_LO_MASK);
      pulse = base;
      break;

    case 4: /* 远光同步快闪 */
    {
      uint16_t phase = GetPhase1ms((uint16_t)(fast_ms * 2U));
      mask = (uint8_t)(CH_L_HI_MASK | CH_R_HI_MASK);
      pulse = (phase < fast_ms) ? base : 0U;
      break;
    }

    case 5: /* 远近交替闪：A=双近光，B=双远光（左右同相） */
    {
      uint16_t phase = GetPhase1ms((uint16_t)(alt_ms * 2U));
      if (phase < alt_ms) {
        mask = (uint8_t)(CH_L_LO_MASK | CH_R_LO_MASK); /* 双近光 */
      } else {
        mask = (uint8_t)(CH_L_HI_MASK | CH_R_HI_MASK); /* 双远光 */
      }
      pulse = base;
      break;
    }

    case 6: /* 近光呼吸（三角波，相位锁定） */
    {
      uint16_t phase = GetPhase1ms(breath_ms);
      uint16_t half = (uint16_t)(breath_ms / 2U);
      uint16_t tri = (phase < half) ? phase : (uint16_t)(breath_ms - phase);
      mask = (uint8_t)(CH_L_LO_MASK | CH_R_LO_MASK);
      pulse = (uint16_t)(((uint32_t)base * (uint32_t)tri) / (uint32_t)half);
      break;
    }

    case 7: /* 远光左右轮闪（双脉冲）：L(100亮130灭100亮330灭) -> R(100亮130灭100亮330灭) */
    {
      uint16_t phase = GetPhase1ms(1320U);
      if (phase < 660U) {
        /* 左组阶段 */
        if ((phase < 100U) || ((phase >= 230U) && (phase < 330U))) {
          mask = CH_L_HI_MASK;
          pulse = base;
        } else {
          mask = 0U;
          pulse = 0U;
        }
      } else {
        /* 右组阶段 */
        uint16_t rphase = (uint16_t)(phase - 660U);
        if ((rphase < 100U) || ((rphase >= 230U) && (rphase < 330U))) {
          mask = CH_R_HI_MASK;
          pulse = base;
        } else {
          mask = 0U;
          pulse = 0U;
        }
      }
      break;
    }

    default:
      mask = 0U;
      pulse = 0U;
      break;
  }

  Channel_ApplyMask(mask);
  PwmGlobal_Set(pulse);
}

static void DebugPrint(const char *s)
{
#if UART_LOG_ENABLE
  HAL_UART_Transmit(&huart1, (uint8_t*)s, strlen(s), 100);
#else
  (void)s;
#endif
}

static void DebugPrintHex(const uint8_t *buf, uint8_t len)
{
#if UART_LOG_ENABLE
  char hex[3];
  uint8_t i;
  for(i = 0; i < len; i++) {
    sprintf(hex, "%02X", buf[i]);
    HAL_UART_Transmit(&huart1, (uint8_t*)hex, 2, 100);
  }
#else
  (void)buf;
  (void)len;
#endif
}

static void DebugPrintDec(uint16_t val)
{
#if UART_LOG_ENABLE
  char buf[6];
  sprintf(buf, "%u", val);
  HAL_UART_Transmit(&huart1, (uint8_t*)buf, strlen(buf), 100);
#else
  (void)val;
#endif
}


/**
 * @brief  更新本地时钟相位基准，积木5：周期边界时启动 LED PWM
 *         使用 HAL_GetTick 的时间差，滚动更新 g_phase_ms
 */
static void SyncTime_Update(void)
{
  uint32_t now = HAL_GetTick();
  uint32_t delta = now - g_last_tick_ms;
  if(delta == 0) return;
  g_last_tick_ms = now;

  uint32_t total = g_phase_ms + delta;
  uint32_t new_cycles = total / SYNC_CYCLE_MS;
  g_cycle += new_cycles;
  g_phase_ms = (uint16_t)(total % SYNC_CYCLE_MS);

        /* 周期边界：跨越 0ms 时立即点亮 LED（PWM 124kHz 60%），积木4 */
  if(new_cycles > 0) {
    HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_2);
    HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_SET);
    g_led_on_tick = now;
    g_led_state = 1;
    #if DEBUG_SYNC_VERBOSE
    DebugPrint("[CYCLE] new_cycle=");
    DebugPrintDec(g_cycle);
    DebugPrint(", phase_reset=0ms\r\n");
#endif
#if DEBUG_LED_VERBOSE
    DebugPrint("[LED] CYCLE @0\r\n");
#endif
  }
}

/**
 * @brief  同步闪灯：时间戳保证至少亮 100ms 后熄灭，积木4/5
 *         PWM_GLOBAL(PA2) 用 TIM1_CH3 PWM，PB6 状态指示
 */
static void SyncLamp_Update(void)
{
  uint32_t now = HAL_GetTick();

  if(g_led_state == 1) {
    if((now - g_led_on_tick) >= SYNC_LED_ON_MS) {
      HAL_TIM_PWM_Stop(&htim1, TIM_CHANNEL_2);
      HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_RESET);
      g_led_state = 0;
      #if DEBUG_LED_VERBOSE
      DebugPrint("[LED] OFF\r\n");
#endif
    }
  }
  /* 注释：移除补亮逻辑，LED只在周期边界点亮 */
  /* 这样确保每个周期只点亮一次，持续100ms */
}

/* 构造同步包，积木8：传输延迟补偿 6ms */
static void BuildSyncPacket(uint8_t *pkt)
{
  uint16_t compensated = g_phase_ms + SYNC_TX_DELAY_MS;
  if(compensated >= SYNC_CYCLE_MS) compensated -= SYNC_CYCLE_MS;

  pkt[0] = 0xAA;
  pkt[1] = 0x55;
  pkt[2] = (uint8_t)(compensated >> 8);
  pkt[3] = (uint8_t)(compensated & 0xFF);
}

static uint16_t ParseSyncPacket(const uint8_t *pkt)
{
  if(pkt[0] != 0xAA || pkt[1] != 0x55) return 0xFFFF;
  return (uint16_t)((pkt[2] << 8) | pkt[3]);
}

/* 临时灯光控制包构造：先占位业务字段（后面替换成你们真正协议） */
static uint8_t TempLight_CalcChecksum(const uint8_t *pkt)
{
  uint8_t x = 0;
  x ^= pkt[0];
  x ^= pkt[1];
  x ^= pkt[2];
  x ^= pkt[3];
  x ^= pkt[TLIGHT_PKT_KEYTRIG_IDX];
  x ^= pkt[TLIGHT_PKT_DEV_ID_L_IDX];
  x ^= pkt[TLIGHT_PKT_DEV_ID_H_IDX];
  x ^= pkt[TLIGHT_PKT_TAG_IDX];
  return x;
}

static void BuildTempLightPacket(uint8_t *pkt, uint8_t mode, uint8_t bright, uint8_t key, uint8_t trig)
{
  uint8_t seq4 = (uint8_t)(g_link_tx_seq & 0x0FU);
  if (key > TLIGHT_KEY_NONE) key = TLIGHT_KEY_NONE;
  if (trig > TLIGHT_TRIG_LONG) trig = TLIGHT_TRIG_NONE;

  pkt[0] = TLIGHT_PKT_HEADER0;
  pkt[1] = TLIGHT_PKT_HEADER1;
  pkt[2] = mode;
  pkt[3] = bright;
  pkt[TLIGHT_PKT_KEYTRIG_IDX] = (uint8_t)(((key & 0x03U) << 6) | ((trig & 0x03U) << 4) | seq4);
  pkt[TLIGHT_PKT_DEV_ID_L_IDX] = (uint8_t)(g_dev_id_local & 0xFFU);
  pkt[TLIGHT_PKT_DEV_ID_H_IDX] = (uint8_t)(g_dev_id_local >> 8);
  pkt[TLIGHT_PKT_TAG_IDX] = TLIGHT_PKT_TAG_CONST;
  pkt[TLIGHT_PKT_CHKSUM_IDX] = TempLight_CalcChecksum(pkt);

